<!DOCTYPE HTML>
<html>
<head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="chrome=1">
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no">

    

    <title>杜瑞斯·萨卡的手札 | 我爱夏雪天</title>
    <meta name="author" content="Jack Wang">
    
    <meta name="description" content="长啸一声会有时!">
    
    
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

    <meta property="og:title" content="杜瑞斯·萨卡的手札"/>
    <meta property="og:site_name" content="我爱夏雪天"/>

    
    <meta property="og:image" content="undefined"/>
    

    <link rel="icon" type="image/png" href="/favicon.png">
    <link rel="alternate" href="/atom.xml" title="我爱夏雪天" type="application/atom+xml">
    <link rel="stylesheet" href="/css/lib/materialize.min.css">
    <link rel="stylesheet" href="/css/lib/font-awesome.min.css">
    <link rel="stylesheet" href="/css/style.css" media="screen" type="text/css">

    
        <link rel="stylesheet" href="/css/lib/prettify-tomorrow-night-eighties.css" type="text/css">
    
    <!--[if lt IE 9]><script src="//html5shiv.googlecode.com/svn/trunk/html5.js"></script><![endif]-->
</head>


<body>
    <img src="/weixin_favicon.png" style="position: absolute; left: -9999px; opacity: 0; filter: alpha(opacity=0);">

    <nav class="indigo">
    <div class="nav-wrapper">
        <a href="#" data-activates="main-menu" class="button-collapse">
            <i class="fa fa-navicon"></i>
        </a>
        <div class="">
            <a href="/" class="brand-logo hide-on-med-and-down">我爱夏雪天</a>
            <ul class="right hide-on-med-and-down">
                
                    <li>
                        <a class="menu-home " href="/" >
                            <i class="fa fa-home "></i>
                            首页
                        </a>
                    </li>
                
                    <li>
                        <a class="menu-archive " href="/archives" >
                            <i class="fa fa-archive "></i>
                            归档
                        </a>
                    </li>
                
                    <li>
                        <a class="menu-category category-menu" href="javascript:;" data-activates="category-menu" >
                            <i class="fa fa-bookmark "></i>
                            分类
                        </a>
                    </li>
                
                    <li>
                        <a class="menu-reading " href="/reading" >
                            <i class="fa fa-book "></i>
                            读书
                        </a>
                    </li>
                
                    <li>
                        <a class="menu-about " href="/about" >
                            <i class="fa fa-user "></i>
                            关于
                        </a>
                    </li>
                
            </ul>
            <div>
    <ul class="side-nav indigo darken-1" id="main-menu">
        
        <li class="side-user">
            <div class="row">
                <div class="col s4 no-padding">
                    <img class="avatar-image circle responsive-img" src="http://7xr6h2.com1.z0.glb.clouddn.com/avataryin.jpg" alt="User Avatar">
                </div>
                <div class="info col s8 valign-wrapper no-padding">
                    <div class="valign">
                        <p class="name">Jack.Wang</p>
                        <p class="desc">单线程 | 程序猿</p>
                    </div>
                </div>
            </div>
        </li>
        

        
            <li class="no-padding">
                <a class="waves-effect menu-home " href="/" >
                    <i class="fa fa-home "></i>
                    首页
                </a>
            </li>
        
            <li class="no-padding">
                <a class="waves-effect menu-archive " href="/archives" >
                    <i class="fa fa-archive "></i>
                    归档
                </a>
            </li>
        
            <li class="no-padding">
                <a class="waves-effect menu-category category-menu" href="javascript:;" data-activates="category-menu" >
                    <i class="fa fa-bookmark "></i>
                    分类
                </a>
            </li>
        
            <li class="no-padding">
                <a class="waves-effect menu-reading " href="/reading" >
                    <i class="fa fa-book "></i>
                    读书
                </a>
            </li>
        
            <li class="no-padding">
                <a class="waves-effect menu-about " href="/about" >
                    <i class="fa fa-user "></i>
                    关于
                </a>
            </li>
        
        <li class="no-padding">
            <a class="waves-effect menu-home " href="/search">
                <i class="fa fa-search"></i>
                搜索
            </a>
        </li>
        <li class="no-padding">
            <a class="waves-effect menu-home " href="http://jkissday.duoshuo.com/admin" target="_blank">
                <i class="fa fa-comments"></i>
                评论
            </a>
        </li>
        <li class="no-padding">
            <a class="waves-effect menu-home " href="/">
                <i class="fa fa-fire"></i>
                彩蛋
            </a>
        </li>
    </ul>

    <ul class="side-nav indigo darken-1" id="category-menu">
        <!--<li class="">
            <h5 class="black-text">分类目录</h5>
        </li>-->

    

            

            <li class="collapse-level-0" collapse-level="0">
                <a class="no-padding" href="/categories/生活/">
                    生活 <span class="right">19 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-0" collapse-level="0">
                <a class="no-padding" href="/categories/艺术/">
                    艺术 <span class="right">2 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-1" collapse-level="1">
                <a class="no-padding" href="/categories/艺术/小说/">
                    小说 <span class="right">1 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-1" collapse-level="1">
                <a class="no-padding" href="/categories/艺术/电影/">
                    电影 <span class="right">1 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-0" collapse-level="0">
                <a class="no-padding" href="/categories/工作/">
                    工作 <span class="right">5 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-0" collapse-level="0">
                <a class="no-padding" href="/categories/技术/">
                    技术 <span class="right">8 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-1" collapse-level="1">
                <a class="no-padding" href="/categories/技术/工具/">
                    工具 <span class="right">1 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-1" collapse-level="1">
                <a class="no-padding" href="/categories/技术/测试/">
                    测试 <span class="right">2 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-1" collapse-level="1">
                <a class="no-padding" href="/categories/技术/web/">
                    web <span class="right">2 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-1" collapse-level="1">
                <a class="no-padding" href="/categories/技术/linux/">
                    linux <span class="right">2 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-1" collapse-level="1">
                <a class="no-padding" href="/categories/技术/数据库/">
                    数据库 <span class="right">1 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-0" collapse-level="0">
                <a class="no-padding" href="/categories/体育/">
                    体育 <span class="right">1 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-0" collapse-level="0">
                <a class="no-padding" href="/categories/private/">
                    private <span class="right">1 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-0" collapse-level="0">
                <a class="no-padding" href="/categories/旅行/">
                    旅行 <span class="right">2 篇</span></a>
                </a>
            </li>

        

    </ul>
</div>
        </div>
    </div>
</nav>

    <main>
        <div class="container main-container">
    

<nav class="page-nav hide-on-small-only">
    <div class="nav-wrapper indigo">
        <span class="breadcrumb">当前位置（目录）</span>
        
            
    
    
    <a class="breadcrumb" href="/categories/艺术/">艺术</a><a class="breadcrumb" href="/categories/艺术/小说/">小说</a>


        

        
    </div>
</nav>

<article>
    <div class="card">
        <div class="card-content">
            

            <div class="article-title">
                
    
        <h1>杜瑞斯·萨卡的手札</h1>
    


            </div>
            <span class="grey-text">发表于</span>
            <time class="indigo-link-context" datetime="2014-02-14T06:23:25.000Z"><a href="/duruisi-sakas-page/">2014-02-14</a></time>

            <span class="grey-text"> | 字数</span>
            <span class="indigo-link-context"><a href="/duruisi-sakas-page/">1,317</a></span>
            <span class="grey-text"> | 预计阅读时间</span>
            <span class="indigo-link-context"><a href="/duruisi-sakas-page/">8分钟</a></span>
            
    <div class="tags-row">
        
            <a href="/tags/杜瑞斯·萨卡的手札/" class="chip green accent-4">杜瑞斯·萨卡的手札</a>
        
    </div>


            <div class="toc indigo-link-context hide-on-med-and-down">
    
</div>


            <div class="entry indigo-link-context">
                <p><span style="color:#E53333;">&#x4E24;&#x4E2A;&#x4EBA;&#x4E0D;&#x89E3;&#x91CA;&#x4EA6;&#x4E0D;&#x4EA4;&#x6D41;&#xFF0C;&#x90FD;&#x9ED8;&#x9ED8;&#x5730;&#x6DF1;&#x4FE1;&#xFF1A;&#x5F3A;&#x6C42;&#x6765;&#x7684;&#x7231;&#x60C5;&#x6211;&#x5B81;&#x53EF;&#x4E0D;&#x8981;&#x3002;&#x56E0;&#x4E3A;&#x7231;&#x7740;&#x522B;&#x4EBA;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x4ED6;&#x4EEC;&#x65E0;&#x4E0D;&#x66F4;&#x7231;&#x81EA;&#x5DF1;&#x3002;</span><a href="http://www.zhihu.com/question/21074881/answer/17102298" target="_blank" rel="external"> --&#x77E5;&#x4E4E;</a></p>
<a id="more"></a>
<blockquote>
<p>&#x6211;&#x4E00;&#x751F;&#x4E2D;&#x6700;&#x5E78;&#x8FD0;&#x7684;&#x4E24;&#x4EF6;&#x4E8B;&#xFF0C;&#x4E00;&#x4EF6;&#xFF0C;&#x662F;&#x65F6;&#x95F4;&#x7EC8;&#x4E8E;&#x5C06;&#x6211;&#x5BF9;&#x4F60;&#x7684;&#x7231;&#x6D88;&#x8017;&#x6B86;&#x5C3D;&#x3002;&#x4E00;&#x4EF6;&#xFF0C;&#x662F;&#x5F88;&#x4E45;&#x5F88;&#x4E45;&#x4EE5;&#x524D;&#x6709;&#x4E00;&#x5929;&#xFF0C;&#x6211;&#x9047;&#x89C1;&#x4F60;&#x2026;&#x2026;</p>
<p>&#x7559;&#x7740;&#x539A;&#x91CD;&#x7684;&#x7D2B;&#x8272;&#x957F;&#x53D1;&#xFF0C;&#x7EAF;&#x7CB9;&#x7684;&#x6DE1;&#x7D2B;&#x8272;&#xFF0C;&#x67D4;&#x548C;&#x5374;&#x4E0D;&#x8273;&#x4E3D;&#x3002;&#x4E0E;&#x4E4B;&#x76F8;&#x914D;&#x7684;&#x9762;&#x5BB9;&#xFF0C;&#x5374;&#x662F;&#x7EDD;&#x7F8E;&#x5F02;&#x5E38;&#xFF0C;&#x5929;&#x751F;&#x7684;&#x9AD8;&#x8D35;&#xFF0C;&#x4E0D;&#x80FD;&#x63A9;&#x9970;&#x3002; &#x90A3;&#x4E00;&#x5929;&#xFF0C;&#x5979;&#x7A7F;&#x7740;&#x6027;&#x611F;&#x7684;&#x66F3;&#x5730;&#x957F;&#x88D9;&#xFF0C;&#x4EFF;&#x4F5B;&#x6CB9;&#x753B;&#x4E2D;&#x8D70;&#x51FA;&#x6765;&#x7684;&#x4E00;&#x822C;&#x3002;</p>
<p>&#x6211;&#x8D70;&#x5230;&#x5979;&#x7684;&#x8EAB;&#x8FB9;&#xFF0C;&#x5979;&#x4E5F;&#x6B23;&#x7136;&#x7684;&#x63A5;&#x53D7;&#x7740;&#x6211;&#x7684;&#x4EB2;&#x543B;&#x3002; &#x51FA;&#x4E8E;&#x793C;&#x8C8C;&#xFF0C;&#x5979;&#x5411;&#x6211;&#x4F4E;&#x5934;&#x5FAE;&#x7B11;&#xFF0C;&#x90A3;&#x79CD;&#x5929;&#x771F;&#x7684;&#x7B11;&#x5BB9;&#xFF0C;&#x8574;&#x542B;&#x7740;&#x65E0;&#x6CD5;&#x8A00;&#x55BB;&#x7684;&#x9B45;&#x529B;&#xFF0C;&#x867D;&#x7136;&#x5979;&#x4E1D;&#x6BEB;&#x6CA1;&#x6709;&#x610F;&#x8BC6;&#x5230;&#x9B45;&#x529B;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x90A3;&#x65F6;&#x7684;&#x6211;&#x4F1A;&#x60F3;&#xFF0C;&#x770B;&#x89C1;&#x8FD9;&#x6837;&#x7684;&#x5FAE;&#x7B11;&#x7684;&#x6BCF;&#x4E00;&#x4EBA;&#xFF0C;&#x8BE5;&#x662F;&#x90FD;&#x751F;&#x51FA;&#x4E86;&#x5947;&#x602A;&#x7684;&#x6B32;&#x671B;&#x3002; &#x4EFF;&#x4F5B;&#xFF0C;&#x53EA;&#x56E0;&#x4E3A;&#x770B;&#x89C1;&#x8FD9;&#x7B11;&#x5BB9;&#xFF0C;&#x4FBF;&#x8BA9;&#x4EBA;&#x53D1;&#x81EA;&#x5185;&#x5FC3;&#x7684;&#x751F;&#x51FA;&#x7231;&#x62A4;&#x5979;&#xFF0C;&#x4EE5;&#x53CA;&#x2026;&#x2026;&#x72EC;&#x5360;&#x5979;&#x7684;&#x6B32;&#x671B;&#x3002; &#x6211;&#x5F00;&#x59CB;&#x5AC9;&#x5992;&#x8428;&#x5170;&#x4E86;&#x3002; &#x518D;&#x4E00;&#x6B21;&#x62AC;&#x5934;&#xFF0C;&#x5374;&#x662F;&#x88AB;&#x4E00;&#x4E2A;&#x6E29;&#x6696;&#x7684;&#x6000;&#x62B1;&#x5305;&#x56F4;&#x4E86;&#x3002;&#x6211;&#x8FD9;&#x624D;&#x610F;&#x8BC6;&#x5230;&#xFF0C;&#x5341;&#x5E74;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x8BA9;&#x6240;&#x6709;&#x7684;&#x4E00;&#x5207;&#x90FD;&#x53D1;&#x751F;&#x4E86;&#x5F88;&#x5927;&#x7684;&#x6539;&#x53D8;&#x3002; &#x8428;&#x5170;&#x90A3;&#x539F;&#x672C;&#x9F50;&#x80A9;&#x7684;&#x77ED;&#x53D1;&#x53D8;&#x6210;&#x4E86;&#x6574;&#x9F50;&#x7684;&#x788E;&#x53D1;&#xFF0C;&#x4E94;&#x5B98;&#x4E5F;&#x892A;&#x53BB;&#x5C11;&#x5E74;&#x65F6;&#x7684;&#x9752;&#x6DA9;&#xFF0C;&#x53D8;&#x6210;&#x66F4;&#x6709;&#x9B45;&#x529B;&#x7684;&#x9752;&#x5E74;&#x7537;&#x5B50;&#x3002;</p>
<p>&#x4E09;&#x5C81;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4ED6;&#x8FD8;&#x53EA;&#x662F;&#x4E2A;&#x7F8E;&#x4E3D;&#x53EF;&#x7231;&#x7684;&#x5B69;&#x5B50;&#xFF0C;&#x73B0;&#x5728;&#x7AD9;&#x5728;&#x4F17;&#x4EBA;&#x9762;&#x524D;&#x7684;&#xFF0C;&#x662F;&#x4E2A;&#x4FCA;&#x7F8E;&#x7684;&#x9752;&#x5E74;&#xFF0C;&#x4E00;&#x4E2A;&#x8BA9;&#x7537;&#x4EBA;&#x548C;&#x5973;&#x4EBA;&#x90FD;&#x75AF;&#x72C2;&#x7684;&#x9752;&#x5E74;&#x3002; &#x800C;&#x6211;&#xFF0C;&#x5374;&#x662F;&#x5728;&#x65F6;&#x95F4;&#x7684;&#x6D2A;&#x6D41;&#x4E2D;&#x5F7B;&#x5E95;&#x4E0E;&#x4ED6;&#x80CC;&#x9053;&#x800C;&#x9A70;&#x4E86;&#x3002; &#x6211;&#x867D;&#x7136;&#x957F;&#x9AD8;&#x4E86;&#xFF0C;&#x5374;&#x662F;&#x56E0;&#x4E3A;&#x5E38;&#x5E74;&#x4E0D;&#x89C1;&#x65E5;&#x5149;&#x7684;&#x7F18;&#x6545;&#x4E5F;&#x4F7F;&#x5F97;&#x76AE;&#x80A4;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x7684;&#x82CD;&#x767D;&#xFF0C;&#x738B;&#x5BAB;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x538B;&#x6291;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x8BA9;&#x6211;&#x539F;&#x672C;&#x5B8C;&#x7F8E;&#x7684;&#x4EBA;&#x751F;&#x8F68;&#x8FF9;&#x5F7B;&#x5E95;&#x5927;&#x4E71;&#x3002;</p>
<p>&#x675C;&#x745E;&#x65AF;&#xB7;&#x8428;&#x5170;&#x6CE8;&#x5B9A;&#x4E86;&#x662F;&#x9AD8;&#x8D35;&#x5723;&#x6D01;&#x7684;&#x4EE3;&#x540D;&#x8BCD;&#xFF0C;&#x5C31;&#x5982;&#x540C;&#x768E;&#x6D01;&#x7684;&#x6708;&#x4EAE;&#x7684;&#x7F8E;&#x4E3D;&#xFF0C;&#x6CA1;&#x6709;&#x4E00;&#x4E1D;&#x4E00;&#x6BEB;&#x7684;&#x6C61;&#x79FD;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x770B;&#x89C1;&#x7684;&#x4EBA;&#x90FD;&#x6709;&#x63A5;&#x8FD1;&#x4ED6;&#xFF0C;&#x4EB2;&#x8FD1;&#x4ED6;&#x7684;&#x6B32;&#x671B;&#x3002;</p>
<p>&#x800C;&#x675C;&#x745E;&#x65AF;&#xB7;&#x8428;&#x5361;&#x5728;&#x675C;&#x745E;&#x65AF;&#x5BB6;&#x65CF;&#x7684;&#x7CDC;&#x70C2;&#x98CE;&#x6C14;&#x4E0B;&#xFF0C;&#x5FD8;&#x8BB0;&#x4E86;&#x5149;&#x660E;&#xFF0C;&#x7528;&#x7CDC;&#x70C2;&#x7684;&#x751F;&#x6D3B;&#x9EBB;&#x9189;&#x81EA;&#x5DF1;&#x7684;&#x5FC3;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x6240;&#x671F;&#x76FC;&#x7684;&#x675C;&#x745E;&#x65AF;&#xB7;&#x8428;&#x5361;&#x4E0D;&#x9700;&#x8981;&#x672A;&#x6765;&#x3002;&#x4ED6;&#x4EEC;&#x6240;&#x9700;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x5C06;&#x4E16;&#x754C;&#x90FD;&#x5F53;&#x4F5C;&#x7D2F;&#x8D58;&#x7684;&#x4EBA;&#xFF0C;&#x4ED6;&#x6240;&#x9700;&#x8981;&#x7684;&#x53EA;&#x662F;&#x5BD2;&#x51B7;&#x5BC2;&#x5BDE;&#xFF0C;&#x5FC3;&#x4E5F;&#x662F;&#x6DF1;&#x4E0D;&#x89C1;&#x5E95;&#x7684;&#x9ED1;&#x8272;&#x3002;</p>
<p>&#x8D70;&#x5728;&#x68B5;&#x8482;&#x5188;&#x7687;&#x5BAB;&#x7684;&#x9057;&#x5740;&#x4E4B;&#x4E0A;&#xFF0C;&#x83AB;&#x540D;&#x7684;&#x60B2;&#x4F24;&#x7B3C;&#x7F69;&#x7740;&#x8FD9;&#x7247;&#x5927;&#x5730;&#x3002; &#x5230;&#x5904;&#x90FD;&#x662F;&#x8EBA;&#x5728;&#x70C2;&#x6CE5;&#x548C;&#x6742;&#x8349;&#x4E2D;&#x7684;&#x77F3;&#x5934;&#xFF0C;&#x4EE5;&#x53CA;&#x5EFA;&#x7B51;&#x7684;&#x6B8B;&#x4F59;&#xFF0C;&#x6211;&#x95ED;&#x4E0A;&#x773C;&#xFF0C;&#x611F;&#x53D7;&#x98CE;&#x4E2D;&#x7684;&#x6E29;&#x6696;&#x3002;</p>
<p>&#x611F;&#x89C9;&#x6709;&#x4E00;&#x53CC;&#x624B;&#xFF0C;&#x6B63;&#x5728;&#x78B0;&#x89E6;&#x6211;&#xFF0C;&#x90A3;&#x662F;&#x65E0;&#x6CD5;&#x60F3;&#x8C61;&#x7684;&#x6E29;&#x6696;&#xFF0C;&#x90A3;&#x53CC;&#x624B;&#xFF0C;&#x62B1;&#x4F4F;&#x6211;&#xFF0C;&#x4EB2;&#x543B;&#x7740;&#xFF0C;&#x5C06;&#x6700;&#x6DF1;&#x523B;&#x7684;&#x6E29;&#x6696;&#x4F20;&#x7ED9;&#x6211;&#x3002; &#x6211;&#x8DEA;&#x4E0B;&#x4E86;&#xFF0C;&#x624B;&#x6307;&#x63D2;&#x8FDB;&#x571F;&#x4E2D;&#xFF0C;&#x51E0;&#x4E4E;&#x662F;&#x7528;&#x5C3D;&#x4E86;&#x5168;&#x8EAB;&#x7684;&#x529B;&#x91CF;&#x6765;&#x6297;&#x62D2;&#x90A3;&#x77AC;&#x95F4;&#x6D8C;&#x4E0A;&#x7684;&#x8D1F;&#x9762;&#x60C5;&#x7EEA;&#x3002;</p>
<p>&#x547D;&#x8FD0;&#x6CE8;&#x5B9A;&#x4E86;&#x6211;&#x53EA;&#x80FD;&#x7B97;&#x662F;&#x675C;&#x62C9;&#x5FB7;&#x5BB6;&#x65CF;&#x4E0B;&#x4E00;&#x4E2A;&#x53EA;&#x4E3A;&#x9AD8;&#x8D35;&#x800C;&#x751F;&#x7684;&#x4EA7;&#x7269;&#xFF0C;&#x624B;&#x6307;&#x6D41;&#x51FA;&#x4E86;&#x8840;&#xFF0C;&#x6CA1;&#x6709;&#x75DB;&#xFF0C;&#x5FC3;&#x4E2D;&#x7684;&#x75DB;&#x662F;&#x624B;&#x6307;&#x7684;&#x75DB;&#x7684;&#x5343;&#x767E;&#x500D;&#x3002;</p>
<p>&#x76F4;&#x5230;&#x5979;&#x7684;&#x5230;&#x6765;&#x3002; &#x4F9D;&#x65E7;&#x662F;&#x90A3;&#x62B9;&#x539A;&#x91CD;&#x7684;&#x7D2B;&#x8272;&#x957F;&#x53D1;&#xFF0C;&#x9AD8;&#x8D35;&#x7684;&#x5BB9;&#x8C8C;&#xFF0C;&#x4E00;&#x5E2D;&#x767D;&#x7EB1;&#x7684;&#x516C;&#x4E3B;&#x88D9;&#x886C;&#x6258;&#x4E86;&#x5979;&#x767D;&#x7699;&#x7684;&#x80A4;&#x8272;&#x3002; &#x5979;&#x4F38;&#x51FA;&#x624B;&#xFF0C;&#x5C06;&#x8981;&#x78B0;&#x89E6;&#x6211;&#x7684;&#x8EAB;&#x4F53;&#xFF0C;&#x5374;&#x5728;&#x89E6;&#x624B;&#x53EF;&#x53CA;&#x7684;&#x5730;&#x65B9;&#x53C8;&#x505C;&#x4F4F;&#x4E86;&#x3002; &#x5979;&#x8BF4;&#x5728;&#x6211;&#x51CC;&#x4E71;&#x7684;&#x91D1;&#x53D1;&#x4E0B;&#x7F8E;&#x4E3D;&#x7684;&#x773C;&#x775B;&#x6DF1;&#x5904;&#xFF0C;&#x6709;&#x7684;&#x53EA;&#x662F;&#x6068;&#x610F;&#x3002;&#x5979;&#x770B;&#x89C1;&#x4E86;&#x6211;&#x5BF9;&#x675C;&#x745E;&#x65AF;&#x5BB6;&#x65CF;&#x7684;&#x6068;&#xFF0C;&#x5BF9;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x7684;&#x6068;&#xFF0C;&#x53EF;&#x662F;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#xFF1F;&#x5979;&#x4E0D;&#x505C;&#x7684;&#x8FFD;&#x95EE;&#xFF0C;&#x773C;&#x6CEA;&#x5FEB;&#x8981;&#x6D41;&#x51FA;&#x6765;&#x4E86;&#x3002;</p>
<p>&#x5F97;&#x5230;&#x7684;&#x56DE;&#x7B54;&#x662F;&#x62D2;&#x7EDD;&#x3002; &#x6211;&#x77E5;&#x9053;&#xFF0C;&#x5979;&#x5BB3;&#x6015;&#xFF0C;&#x5BB3;&#x6015;&#x8428;&#x5170;&#x4F1A;&#x906D;&#x5230;&#x8FEB;&#x5BB3;&#x3002; &#x5728;&#x5979;&#x770B;&#x6765;&#xFF0C;&#x4E0D;&#xFF0C;&#x5728;&#x6240;&#x6709;&#x4EBA;&#x773C;&#x4E2D;&#xFF0C;&#x675C;&#x745E;&#x65AF;&#xB7;&#x8428;&#x5361;&#x53EA;&#x80FD;&#x7B97;&#x662F;&#x4E2A;&#x7834;&#x574F;&#x8005;&#x3002; &#x54C0;&#x4F24;&#xFF0C;&#x5F25;&#x6F2B;&#x5728;&#x7A7A;&#x6C14;&#x4E2D;&#x7684;&#x54C0;&#x4F24;&#x3002; &#x7F20;&#x7EF5;&#x60B1;&#x607B;&#x7684;&#x5FC3;&#x601D;&#xFF0C;&#x5728;&#x7075;&#x9B42;&#x6DF1;&#x5904;&#x6FC0;&#x8361;&#x2026;&#x2026; &#x5FC3;&#x7A81;&#x7136;&#x53D8;&#x5F97;&#x7A7A;&#x843D;&#x843D;&#x3002;</p>
<p>&#x66FE;&#x7ECF;&#xFF0C;&#x6211;&#x7684;&#x4FDD;&#x59C6;&#x5BF9;&#x6211;&#x8BF4;&#x8FC7;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x6545;&#x4E8B;&#x2014;&#x2014; &#x4E00;&#x4E2A;&#x58EB;&#x5175;&#x7231;&#x4E0A;&#x4E00;&#x4E2A;&#x516C;&#x4E3B;&#xFF0C;&#x516C;&#x4E3B;&#x544A;&#x8BC9;&#x4ED6;&#xFF0C;&#x5982;&#x679C;&#x4ED6;&#x613F;&#x610F;&#x8FDE;&#x7EED;100&#x4E2A;&#x665A;&#x4E0A;&#x5B88;&#x5728;&#x5979;&#x7684;&#x9633;&#x53F0;&#x4E0B;&#xFF0C;&#x5979;&#x5C31;&#x63A5;&#x53D7;&#x4ED6;&#x3002;&#x4E8E;&#x662F;&#x58EB;&#x5175;&#x7167;&#x505A;&#x4E86;&#xFF0C;&#x65E0;&#x8BBA;&#x591A;&#x4E48;&#x6076;&#x52A3;&#x7684;&#x5929;&#x6C14;&#xFF0C;&#x4ED6;&#x90FD;&#x4E0D;&#x79BB;&#x5F00;&#xFF0C;&#x4ED6;&#x7B49;&#x4E86;&#x4E00;&#x5929;&#xFF0C;&#x4E24;&#x5929;&#xFF0C;&#x4E09;&#x5929;&#x2026;&#x2026;&#x76F4;&#x5230;&#x7B2C;&#x4E5D;&#x5341;&#x4E5D;&#x5929;&#xFF0C;&#x4ED6;&#x5374;&#x7AD9;&#x8D77;&#x8EAB;&#xFF0C;&#x79BB;&#x5F00;&#x4E86;&#x5979;&#x3002;</p>
</blockquote>

            </div>

            
            <section class="reward">
                <!-- Donate Module -->
<div id="donate_module">
    <style type="text/css">
        .hidden {
            display: none;
        }
        .donate_bar a.btn_donate {
            display: inline-block;
            width: 82px;
            height: 82px;
            background: url("http://img.t.sinajs.cn/t5/style/images/apps_PRF/e_media/btn_reward.gif") no-repeat;
            _background: url("http://img.t.sinajs.cn/t5/style/images/apps_PRF/e_media/btn_reward.gif") no-repeat;

            -webkit-transition: background 0s;
            -moz-transition: background 0s;
            -o-transition: background 0s;
            -ms-transition: background 0s;
            transition: background 0s;
        }
        .donate_bar a.btn_donate:hover {
            background-position: 0 -82px;
        }
        .donate_bar .donate_txt {
            display: block;
            color: #9d9d9d;
            font: 14px/2 "Microsoft Yahei";
        }
        .bold {
            font-weight: bold;
        }

        img.qrcode {
            width: 90%;
            margin-bottom: 10px;
        }
        @media only screen and (min-width: 1025px) {
            img.qrcode {
                width: 40%;
                margin-right: 10px;
            }
        }

    </style>

    <!-- btn_donate & tips -->
    <div id="donate_board" class="donate_bar center">
        <a id="btn_donate" class="btn_donate" target="_self" href="javascript:;" title="Donate 打赏"></a>
        <span class="donate_txt">看完啦? 够意思!  土豪~交个朋友吧...</span>
    </div>
    <!-- /btn_donate & tips -->

    <!-- donate guide -->
    <div id="donate_guide" class="donate_bar center hidden">
        
        <img class="qrcode" src="http://7xr6h2.com1.z0.glb.clouddn.com/alipay.png" title="打赏"/>
        
        <img class="qrcode" src="http://7xr6h2.com1.z0.glb.clouddn.com/wechatMe.png" title="打赏"/>
        
    </div>
    <!-- /donate guide -->

    <!-- donate script -->
    <script type="text/javascript">
        document.getElementById('btn_donate').onclick = function() {
            $('#donate_board').addClass('hidden');
            $('#donate_guide').removeClass('hidden');
        }

        function donate_on_web() {
            $('#donate').submit();
        }
    </script>
    <!-- /donate script -->
</div>
<!-- /Donate Module -->

            </section>
            

            <!-- 阅读量 -->
            <span id="busuanzi_container_page_pv">
            <i class="fa fa-eye"></i>
                文章阅读量 <span id="busuanzi_value_page_pv" style="color:indigo">-link-context"></span>次
            </span>
        </div>
    </div>
</article>




    <section id="comment">
        <div class="card">
            <div class="card-content">
                <!-- Duoshuo Comment BEGIN -->
                <div class="ds-thread" data-thread-key="duruisi-sakas-page" data-title="杜瑞斯·萨卡的手札" data-url="http://jkup2.us/duruisi-sakas-page/"></div>
                <script type="text/javascript">
                    var duoshuoQuery = {
                        short_name: 'jkissday'
                    };
                    (function() {
                        var ds = document.createElement('script');
                        ds.type = 'text/javascript';
                        ds.async = true;
                        ds.src = (document.location.protocol == 'https:'
                            ? 'https:'
                            : 'http:') + '//static.duoshuo.com/embed.js';
                        ds.charset = 'UTF-8';
                        (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(ds);
                    })();
                </script>
                <!-- Duoshuo Comment END -->
            </div>
        </div>
    </section>


<!--友言-->
<!--&lt;!&ndash; UY BEGIN &ndash;&gt;-->
<!--<div id="uyan_frame"></div>-->
<!--<script type="text/javascript" src="http://v2.uyan.cc/code/uyan.js?uid=2094227"></script>-->
<!--&lt;!&ndash; UY END &ndash;&gt;-->
</div>

        <div class="fixed-action-btn float-sitemap">
    <a class="btn-floating btn-large green">
      <i class="fa fa-caret-square-o-up"></i>
    </a>
    <ul>
      <li><a class="btn-return-top btn-floating waves-effect blue" title="回到顶部"><i class="fa fa-arrow-circle-o-up"></i></a></li>
      <li><a class="btn-floating waves-effect button-collapse orange"  data-activates="main-menu" title="菜单"><i class="fa fa-navicon"></i></a></li>
    </ul>
  </div>

    </main>
    <footer class="page-footer indigo darken-1">
    
    <div class="container">
        <div class="row">
            
            <div class="social-group col m4 s12">
                <h5 class="white-text">社交</h5>
                
                    <a class="social-link" href="http://weibo.com/hydra7249" target="_blank">
                        <i class="fa fa-2x fa-weibo"></i>
                    </a>
                
                    <a class="social-link" href="http://www.douban.com/people/36529994/" target="_blank">
                        <i class="fa fa-2x fa-star-half-o"></i>
                    </a>
                
                    <a class="social-link" href="https://twitter.com/hydra7249" target="_blank">
                        <i class="fa fa-2x fa-twitter"></i>
                    </a>
                
                    <a class="social-link" href="https://www.pinterest.com/snowvivi/" target="_blank">
                        <i class="fa fa-2x fa-pinterest"></i>
                    </a>
                
                    <a class="social-link" href="https://github.com/olddoggie" target="_blank">
                        <i class="fa fa-2x fa-github"></i>
                    </a>
                
                    <a class="social-link" href="/atom.xml" target="_blank">
                        <i class="fa fa-2x fa-rss"></i>
                    </a>
                
            </div>
            

            
            <div class="col m8 s12">
                <h5 class="white-text">友情链接</h5>
                
                    <a class="social-link" href="http://foredoomed.org/" target="_blank">Zhixingheyi</a>
                
                    <a class="social-link" href="http://blog.sina.com.cn/rokgy" target="_blank">rokgy的博客</a>
                
                    <a class="social-link" href="http://www.dandyweng.com/" target="_blank">dandyweng的博客</a>
                
                    <a class="social-link" href="https://xiaolife.com/" target="_blank">Life Journal</a>
                
                    <a class="social-link" href="http://www.netcan666.com/" target="_blank">Netcan</a>
                
            </div>
            
        </div>
    </div>
    


    <div class="footer-copyright indigo-link-context">
        <div class="container">
            <div class="row">
                <div class="col m4 s12">
                    © 2016 jkup2.us, All rights reserved.
                </div>
                <div class="col m8 s12">
                    <i class="fa fa-rocket"></i> Hexo | 主题 raytaylorism
                    | 总字数 <span>67.3k</span>
                    | 总访问量 <span id="busuanzi_value_site_pv"></span> |
                    访客人次 <span id="busuanzi_value_site_uv"></span> |
                    页点击量 <span id="busuanzi_value_page_pv"></span>
                </div>
            </div>
        </div>
    </div>

    <script async src="https://dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js">
    </script>
</footer>


    <noscript>
    <div class="noscript">
        <p class="center-align">当前浏览器不支持博客完整功能。如果要获得最佳体验，请点击右上角···，复制链接，并在其它浏览器打开</p>
    </div>
</noscript>
<div class="noscript">
    <p class="center-align">当前浏览器不支持博客完整功能。如果要获得最佳体验，请点击右上角···，复制链接，并在其它浏览器打开</p>
</div>


<script src="/js/jquery-2.1.1.min.js"></script>
<script src="/js/materialize.min.js"></script>
<script src="/js/search.js"></script>
<script src="/js/base64.js"></script>


<script>
(function($) {
    $(document).ready(function() {
        // 隐藏禁用javascript（针对微信内置浏览器）的提示
        $('.noscript').hide();

        // 图片缩放效果
        var $imgs = $('img').not('.slider-image').not('.avatar-image').not('.carousel-image').not('.card-cover-image').not('.qrcode');

        // 给图片加上点击放大效果（materialbox插件）
        $imgs.addClass('materialboxed')
            .each(function(i, el) {
                $(this).attr('data-caption', $(this).attr('alt') || ' ');
            }).materialbox();

        // 首页幻灯片
        $('.slider').slider({
            indicators: true,
            full_width: true,
            interval: 8000
        });

        $(".button-collapse").sideNav();
        $(".category-menu").sideNav();

        // 针对gallery post
        $('.carousel').carousel({
            full_width: true
        });
        $('.carousel-control.prev').click(function() {
            $('.carousel').carousel('prev');
        });
        $('.carousel-control.next').click(function() {
            $('.carousel').carousel('next');
        });

        // 文章目录
        $('article').not('.simple-article').find('h1').add('h2').add('h3').add('h4').add('h5').add('h6').scrollSpy();
        // 修正文章目录的left-border颜色
        var color = $('.table-of-contents-text').css('color');
        $('.table-of-contents-link').css('border-left-color', color);

        // 针对移动端做的优化：FAB按钮点击一下收回
        if (/Android|webOS|iPhone|iPad|iPod|BlackBerry|IEMobile|Opera Mini/i.test(navigator.userAgent)) {
            $('.fixed-action-btn').addClass('click-to-toggle');
        }
        // 回到顶部
        $('.btn-return-top').click(function() {
            $('body, html').animate({
                scrollTop: 0
            }, 500);
        });

        // 重置读书页面的Tab标签页的颜色
        $('li.tab a').hover(function() {
            $(this).toggleClass('text-lighten-4');
        });
        $('.indicator').addClass('green lighten-2');

        
        // 添加new标签
        $('.menu-reading').append('<span class="new badge pink"></span>');
        
    });
})(jQuery);
</script>


<script src="/js/prettify.js"></script>
<script type="text/javascript">
    $(document).ready(function() {
        $("pre").addClass("prettyprint");
        prettyPrint();
    });
</script>






<script type="text/x-mathjax-config">
MathJax.Hub.Config({
  tex2jax: {inlineMath: [['$','$'], ['\\(','\\)']]}
});
</script>
<script type="text/javascript"
    src="http://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML">
</script>



<script type="text/javascript">
    var search_path = "search.xml";
    if (search_path.length == 0) {
        search_path = "search.xml";
    }
    var path = "/" + search_path;
    searchFunc(path, 'local-search-input', 'local-search-result');
</script>

<!--1. category或tag页面是private/PRIVATE的需要密码-->
<!--2. 文章tag当中有private/PRIVATE的需要密码-->
<!--3. 理论上文章列表页面上tag当中有private/PRIVATE的文章已经被过滤,但如果存在,不影响页面展示,当点击文章链接后需要密码-->
<script type="text/javascript">
    var b = new Base64();
    var passwd = b.decode("c3c=")
    var url = window.location.toString().split("/");
    var urlLen = url.length;
    var urlCat = url[urlLen-3].trim();
    var urlNm = url[urlLen-2].trim();
    (function(){
        if( (urlCat == "categories" || urlCat == "tags") && (urlNm=="private" || urlNm == "PRIVATE")){
            if (prompt('请输入文章密码') !== passwd){
                alert('密码错误！');
                history.back();
            }
        }
    })();
    var nonSecret= true;
    var tags = document.getElementsByClassName("tags-row");
    (function(){
        for (var i = 0; i < tags.length; i++) {
            var tagName = tags[i].innerHTML.replace(/<[^>]+>/g,"").trim();
            if(urlCat!="page" && (tagName.indexOf("private")>=0 || tagName.indexOf("PRIVATE")>=0)){
                nonSecret=false
            }
        }
        if (!nonSecret) {
            if (prompt('请输入文章密码') !== passwd){
                alert('密码错误！');
                history.back();
            }
        }
    })();
</script>
</body>
</html>
