<!DOCTYPE HTML>
<html>
<head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="chrome=1">
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no">

    

    <title>告别滚筒洗衣机 | 我爱夏雪天</title>
    <meta name="author" content="Jack Wang">
    
    <meta name="description" content="长啸一声会有时!">
    
    
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

    <meta property="og:title" content="告别滚筒洗衣机"/>
    <meta property="og:site_name" content="我爱夏雪天"/>

    
    <meta property="og:image" content="undefined"/>
    

    <link rel="icon" type="image/png" href="/favicon.png">
    <link rel="alternate" href="/atom.xml" title="我爱夏雪天" type="application/atom+xml">
    <link rel="stylesheet" href="/css/lib/materialize.min.css">
    <link rel="stylesheet" href="/css/lib/font-awesome.min.css">
    <link rel="stylesheet" href="/css/style.css" media="screen" type="text/css">

    
        <link rel="stylesheet" href="/css/lib/prettify-tomorrow-night-eighties.css" type="text/css">
    
    <!--[if lt IE 9]><script src="//html5shiv.googlecode.com/svn/trunk/html5.js"></script><![endif]-->
</head>


<body>
    <img src="/weixin_favicon.png" style="position: absolute; left: -9999px; opacity: 0; filter: alpha(opacity=0);">

    <nav class="indigo">
    <div class="nav-wrapper">
        <a href="#" data-activates="main-menu" class="button-collapse">
            <i class="fa fa-navicon"></i>
        </a>
        <div class="">
            <a href="/" class="brand-logo hide-on-med-and-down">我爱夏雪天</a>
            <ul class="right hide-on-med-and-down">
                
                    <li>
                        <a class="menu-home " href="/" >
                            <i class="fa fa-home "></i>
                            首页
                        </a>
                    </li>
                
                    <li>
                        <a class="menu-archive " href="/archives" >
                            <i class="fa fa-archive "></i>
                            归档
                        </a>
                    </li>
                
                    <li>
                        <a class="menu-category category-menu" href="javascript:;" data-activates="category-menu" >
                            <i class="fa fa-bookmark "></i>
                            分类
                        </a>
                    </li>
                
                    <li>
                        <a class="menu-reading " href="/reading" >
                            <i class="fa fa-book "></i>
                            读书
                        </a>
                    </li>
                
                    <li>
                        <a class="menu-about " href="/about" >
                            <i class="fa fa-user "></i>
                            关于
                        </a>
                    </li>
                
            </ul>
            <div>
    <ul class="side-nav indigo darken-1" id="main-menu">
        
        <li class="side-user">
            <div class="row">
                <div class="col s4 no-padding">
                    <img class="avatar-image circle responsive-img" src="http://7xr6h2.com1.z0.glb.clouddn.com/avataryin.jpg" alt="User Avatar">
                </div>
                <div class="info col s8 valign-wrapper no-padding">
                    <div class="valign">
                        <p class="name">Jack.Wang</p>
                        <p class="desc">单线程 | 程序猿</p>
                    </div>
                </div>
            </div>
        </li>
        

        
            <li class="no-padding">
                <a class="waves-effect menu-home " href="/" >
                    <i class="fa fa-home "></i>
                    首页
                </a>
            </li>
        
            <li class="no-padding">
                <a class="waves-effect menu-archive " href="/archives" >
                    <i class="fa fa-archive "></i>
                    归档
                </a>
            </li>
        
            <li class="no-padding">
                <a class="waves-effect menu-category category-menu" href="javascript:;" data-activates="category-menu" >
                    <i class="fa fa-bookmark "></i>
                    分类
                </a>
            </li>
        
            <li class="no-padding">
                <a class="waves-effect menu-reading " href="/reading" >
                    <i class="fa fa-book "></i>
                    读书
                </a>
            </li>
        
            <li class="no-padding">
                <a class="waves-effect menu-about " href="/about" >
                    <i class="fa fa-user "></i>
                    关于
                </a>
            </li>
        
        <li class="no-padding">
            <a class="waves-effect menu-home " href="/search">
                <i class="fa fa-search"></i>
                搜索
            </a>
        </li>
        <li class="no-padding">
            <a class="waves-effect menu-home " href="http://jkissday.duoshuo.com/admin" target="_blank">
                <i class="fa fa-comments"></i>
                评论
            </a>
        </li>
        <li class="no-padding">
            <a class="waves-effect menu-home " href="/">
                <i class="fa fa-fire"></i>
                彩蛋
            </a>
        </li>
    </ul>

    <ul class="side-nav indigo darken-1" id="category-menu">
        <!--<li class="">
            <h5 class="black-text">分类目录</h5>
        </li>-->

    

            

            <li class="collapse-level-0" collapse-level="0">
                <a class="no-padding" href="/categories/生活/">
                    生活 <span class="right">20 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-0" collapse-level="0">
                <a class="no-padding" href="/categories/艺术/">
                    艺术 <span class="right">2 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-1" collapse-level="1">
                <a class="no-padding" href="/categories/艺术/小说/">
                    小说 <span class="right">1 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-1" collapse-level="1">
                <a class="no-padding" href="/categories/艺术/电影/">
                    电影 <span class="right">1 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-0" collapse-level="0">
                <a class="no-padding" href="/categories/工作/">
                    工作 <span class="right">5 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-0" collapse-level="0">
                <a class="no-padding" href="/categories/技术/">
                    技术 <span class="right">8 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-1" collapse-level="1">
                <a class="no-padding" href="/categories/技术/工具/">
                    工具 <span class="right">1 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-1" collapse-level="1">
                <a class="no-padding" href="/categories/技术/测试/">
                    测试 <span class="right">2 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-1" collapse-level="1">
                <a class="no-padding" href="/categories/技术/web/">
                    web <span class="right">2 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-1" collapse-level="1">
                <a class="no-padding" href="/categories/技术/linux/">
                    linux <span class="right">2 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-1" collapse-level="1">
                <a class="no-padding" href="/categories/技术/数据库/">
                    数据库 <span class="right">1 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-0" collapse-level="0">
                <a class="no-padding" href="/categories/体育/">
                    体育 <span class="right">1 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-0" collapse-level="0">
                <a class="no-padding" href="/categories/旅行/">
                    旅行 <span class="right">2 篇</span></a>
                </a>
            </li>

        

    </ul>
</div>
        </div>
    </div>
</nav>

    <main>
        <div class="container main-container">
    

<nav class="page-nav hide-on-small-only">
    <div class="nav-wrapper indigo">
        <span class="breadcrumb">当前位置（目录）</span>
        
            
    
    
    <a class="breadcrumb" href="/categories/生活/">生活</a>


        

        
    </div>
</nav>

<article>
    <div class="card">
        <div class="card-content">
            

            <div class="article-title">
                
    
        <h1>告别滚筒洗衣机</h1>
    


            </div>
            <span class="grey-text">发表于</span>
            <time class="indigo-link-context" datetime="2014-01-07T16:37:09.000Z"><a href="/goodbye-drum-washing-machine/">2014-01-08</a></time>

            <span class="grey-text"> | 字数</span>
            <span class="indigo-link-context"><a href="/goodbye-drum-washing-machine/">2,037</a></span>
            <span class="grey-text"> | 预计阅读时间</span>
            <span class="indigo-link-context"><a href="/goodbye-drum-washing-machine/">13分钟</a></span>
            
    <div class="tags-row">
        
            <a href="/tags/随笔/" class="chip green accent-4">随笔</a>
        
    </div>


            <div class="toc indigo-link-context hide-on-med-and-down">
    
</div>


            <div class="entry indigo-link-context">
                <p>&#x4E0D;&#x77E5;&#x9053;&#x662F;&#x4E0D;&#x559C;&#x6B22;&#x67EF;&#x5357;&#x8FD8;&#x662F;&#x60F3;&#x8981;&#x5BF9;&#x65E7;&#x7231;&#x6765;&#x4E2A;&#x5F7B;&#x5E95;&#x7684;say no&#xFF0C;&#x6BCD;&#x4E0A;&#x5C31;&#x662F;&#x4E0D;&#x8003;&#x8651;&#x6EDA;&#x7B52;&#x6D17;&#x8863;&#x673A;&#xFF01;&#x73B0;&#x5728;&#x7528;&#x7684;&#x8FD9;&#x4E2A;&#x897F;&#x95E8;&#x5B50;&#x5341;&#x51E0;&#x5E74;&#x524D;&#x8EAB;&#x4EF7;&#x4E24;&#x5343;&#x6765;&#x5757;&#xFF0C;&#x53EF;&#x8FD9;&#x4E00;&#x6B21;&#x5979;&#x7ADF;&#x7136;&#x5728;&#x4E24;&#x4E2A;&#x4E00;&#x5343;&#x51FA;&#x5934;&#x7684;&#x571F;&#x9CD6;&#x673A;&#x5668;&#x9762;&#x524D;&#x72B9;&#x8C6B;&#x4E86;&#x597D;&#x4E00;&#x9635;&#x5B50;&#xFF0C;&#x6700;&#x540E;&#x5728;&#x5C0F;&#x5929;&#x9E45;&#x548C;&#x4E09;&#x6D0B;&#x4E4B;&#x95F4;&#x5A9A;&#x5916;&#x7684;&#x9009;&#x62E9;&#x4E86;&#x540E;&#x8005;&#x7684;&#x6CE2;&#x8F6E;&#x6D17;&#x8863;&#x673A;&#x3002;</p>
<p>&#x4ECA;&#x5929;&#x4E0B;&#x4E86;&#x4E00;&#x5929;&#x7684;&#x96E8;&#x6211;&#x5C31;&#x9690;&#x7EA6;&#x6709;&#x79CD;&#x8981;&#x7FD4;&#x7684;&#x9884;&#x611F;&#x3002;&#x679C;&#x7136;&#x9001;&#x673A;&#x5668;&#x7684;&#x53EA;&#x8D1F;&#x8D23;&#x9001;&#x673A;&#x5668;&#x548C;&#x642C;&#x65E7;&#x8D27;&#xFF0C;&#x5B89;&#x88C5;&#x9700;&#x8981;&#x989D;&#x5916;&#x9884;&#x7EA6;&#x3002;&#x7236;&#x4E0A;call&#x6211;&#x8981;&#x6211;&#x9884;&#x7EA6;&#x5B89;&#x88C5;&#xFF0C;&#x672C;&#x6765;&#x4E5F;&#x662F;&#x5F88;&#x7B80;&#x5355;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6211;&#x8BF4;&#x6211;&#x6765;&#x9884;&#x7EA6;&#x5427;&#x3002;&#x4F46;&#x540E;&#x6765;&#x4E00;&#x770B;&#x9884;&#x7EA6;&#x5B89;&#x88C5;&#x4ED6;&#x4EEC;&#x8981;&#x4E09;&#x5929;&#x4E0A;&#x95E8;&#xFF0C;&#x89C9;&#x5F97;&#x5B9E;&#x5728;&#x9EBB;&#x70E6;&#xFF0C;&#x60F3;&#x6765;&#x6D17;&#x8863;&#x673A;&#x5E94;&#x8BE5;&#x4E0D;&#x96BE;&#x88C5;&#x5427;&#xFF0C;&#x5C31;&#x56DE;call&#x7236;&#x4E0A;&#xFF0C;&#x8BA9;&#x4ED6;&#x80FD;&#x88C5;&#x5219;&#x88C5;&#xFF0C;&#x88C5;&#x4E0D;&#x6765;&#x6211;&#x518D;&#x7535;&#x8BDD;&#x9884;&#x7EA6;&#x5382;&#x5BB6;&#x3002; &#x7ED3;&#x679C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7236;&#x4E0A;&#x548C;&#x6211;&#x4E00;&#x4E2A;&#x5C3F;&#x6027;&#xFF0C;&#x81EA;&#x5DF1;&#x52A8;&#x624B;&#x4E30;&#x8863;&#x8DB3;&#x98DF;&#x3002;&#x3002;&#x3002;</p>
<p>&#x540E;&#x6765;&#x56DE;&#x5BB6;&#x624D;&#x77E5;&#x9053;&#x4ED6;&#x6015;&#x9EBB;&#x70E6;&#xFF0C;&#x82B1;&#x4E86;&#x5341;&#x5757;&#x94B1;&#x627E;&#x6765;&#x697C;&#x4E0B;&#x4FEE;&#x7535;&#x8111;&#x7684;&#x5E2E;&#x5FD9;&#x3002;&#x90A3;&#x4E2A;&#x4FEE;&#x7535;&#x8111;&#x7684;&#x4F30;&#x8BA1;&#x662F;&#x5BF9;&#x7740;&#x7535;&#x8111;&#x64B8;&#x591A;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x673A;&#x5668;&#x653E;&#x7684;&#x4F4D;&#x7F6E;&#x79BB;&#x6392;&#x6C34;&#x7684;&#x7AD6;&#x7BA1;&#x5F88;&#x8FD1;&#xFF0C;&#x4E2B;&#x7D22;&#x6027;&#x628A;&#x6392;&#x6C34;&#x7BA1;&#x5B50;&#x51CF;&#x6389;&#x4E00;&#x5927;&#x622A;&#xFF0C;&#x770B;&#x4F3C;&#x8F7B;&#x677E;&#x7684;&#x4EA4;&#x4E86;&#x5DEE;&#x3002; &#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#xFF0C;&#x8868;&#x9762;&#x529F;&#x592B;&#x597D;&#x7684;&#x4E00;&#x822C;&#x7528;&#x8D77;&#x6765;&#x90FD;&#x4E0D;&#x5927;&#x9760;&#x8C31;&#xFF0C;&#x7236;&#x4E0A;&#x548C;&#x6BCD;&#x4E0A;&#x8DC3;&#x8DC3;&#x6B32;&#x8BD5;&#x7684;&#x5F00;&#x673A;&#x8BD5;&#x7528;&#xFF0C;&#x5374;&#x4E0D;&#x6599;&#x8131;&#x6C34;&#x4EE5;&#x540E;&#xFF0C;&#x6D74;&#x5BA4;&#x91CC;&#x7684;&#x4E24;&#x4E2A;&#x4E0B;&#x6C34;&#x9053;&#x53E3;&#x96C6;&#x4F53;&#x53CD;&#x6D8C;&#xFF01;</p>
<a id="more"></a>
<p>&#x6BCD;&#x4E0A;&#x5F00;&#x59CB;&#x9F99;&#x989C;&#x5927;&#x6012;&#xFF0C;&#x7236;&#x4E0A;&#x4FBF;&#x6210;&#x4E86;&#x51FA;&#x6C14;&#x7B52;&#xFF0C;&#x53C8;call&#x6211;&#xFF0C;&#x4ECE;&#x8BED;&#x6C14;&#x548C;&#x6001;&#x5EA6;&#x4E0A;&#x987A;&#x4FBF;&#x628A;&#x6211;&#x4E5F;&#x9119;&#x89C6;&#x4E86;&#x6570;&#x56DE;&#x3002;&#x56DE;&#x5BB6;&#x540E;&#x7236;&#x4E0A;&#x81EA;&#x4FE1;&#x6EE1;&#x6EE1;&#x7684;&#x8BF4;&#xFF0C;&#x5DF2;&#x7ECF;&#x901A;&#x8FC7;&#x4E0B;&#x6C34;&#x9053;&#x4E86;&#xFF0C;&#x8FD9;&#x4E00;&#x6B21;&#x80AF;&#x5B9A;&#x4E0D;&#x4F1A;&#x53CD;&#x6C34;&#xFF01;&#x7ED3;&#x679C;&#x518D;&#x6B21;&#x5413;&#x5C3F;&#x3002;&#x4F46;&#x4ED4;&#x7EC6;&#x89C2;&#x5BDF;&#x540E;&#xFF0C;&#x770B;&#x8FC7;&#x67EF;&#x5357;&#x7684;&#x4F18;&#x52BF;&#x5C31;&#x4F53;&#x73B0;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x6839;&#x636E;&#x73B0;&#x573A;&#x52D8;&#x67E5;&#xFF0C;&#x6709;&#x4E24;&#x4E2A;&#x4E0B;&#x6C34;&#x9053;&#x51FA;&#x53E3;&#xFF0C;&#x5916;&#x52A0;&#x4E00;&#x8DDF;&#x77ED;&#x77ED;&#x7684;&#x7AD6;&#x7BA1;&#xFF0C;&#x7AD6;&#x7BA1;&#x4EE5;&#x524D;&#x662F;&#x63A5;&#x897F;&#x95E8;&#x5B50;&#x7684;&#x6392;&#x6C34;&#x7BA1;&#x7528;&#x7684;&#xFF0C;&#x800C;&#x897F;&#x95E8;&#x5B50;&#x56E0;&#x4E3A;&#x662F;&#x6EDA;&#x7B52;&#x7684;&#x5173;&#x7CFB;&#x6240;&#x4EE5;&#x51FA;&#x6C34;&#x4F4D;&#x662F;&#x5728;&#x9AD8;&#x5904;&#xFF0C;&#x800C;&#x5982;&#x4ECA;&#x8FD9;&#x4E2A;&#x6CE2;&#x8F6E;&#x76F4;&#x7B52;&#x578B;&#x6D17;&#x8863;&#x673A;&#xFF0C;&#x5B83;&#x662F;&#x4F4E;&#x51FA;&#x6C34;&#x4F4D;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x6C34;&#x52BF;&#x7684;&#x9AD8;&#x4F4E;&#x4E0A;&#x81EA;&#x7136;&#x53C8;&#x8F93;&#x4E86;&#x4E00;&#x622A;&#xFF0C;&#x6C34;&#x52BF;&#x4E0D;&#x591F;&#xFF0C;&#x6C34;&#x4FBF;&#x4F1A;&#x56DE;&#x6D41;&#xFF0C;&#x90A3;&#x4E48;&#x65E2;&#x7136;&#x56DE;&#x4E0D;&#x5230;&#x6D17;&#x8863;&#x673A;&#x91CC;&#xFF0C;&#x5C31;&#x80AF;&#x5B9A;&#x4F1A;&#x4ECE;&#x4E0B;&#x6C34;&#x9053;&#x53E3;&#x53CD;&#x6D8C;&#x3002;&#x601D;&#x53CA;&#x81F3;&#x6B64;&#xFF0C;&#x673A;&#x667A;&#x8BF4;&#x51FA;&#xFF1A;&#x771F;&#x76F8;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#xFF01;&#x7136;&#x540E;&#x5DF4;&#x62C9;&#x5DF4;&#x62C9;&#x5FFD;&#x60A0;&#x4E00;&#x756A;&#xFF0C;&#x7B97;&#x662F;&#x633D;&#x56DE;&#x4E9B;&#x989C;&#x9762;&#x3002;&#x4E8E;&#x662F;&#x6211;&#x4EEC;&#x5C1D;&#x8BD5;&#x653E;&#x5F03;&#x90A3;&#x6839;&#x7AD6;&#x7BA1;&#xFF0C;&#x76F4;&#x63A5;&#x628A;&#x51FA;&#x6C34;&#x7BA1;&#x63D2;&#x5230;&#x6BD4;&#x5B83;&#x66F4;&#x4F4E;&#x7684;&#x4E0B;&#x6C34;&#x9053;&#x53E3;&#xFF0C;&#x8FD9;&#x6837;&#x867D;&#x7136;&#x96BE;&#x770B;&#x4E86;&#x4E00;&#x70B9;&#xFF0C;&#x4E0D;&#x591F;&#x5B8C;&#x7F8E;&#xFF0C;&#x4F46;&#x597D;&#x5728;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x90FD;&#x662F;&#x88AB;&#x6321;&#x4F4F;&#x7684;&#xFF0C;&#x7741;&#x4E00;&#x53EA;&#x773C;&#x95ED;&#x4E00;&#x53EA;&#x773C;&#xFF0C;&#x597D;&#x7528;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;</p>
<p>&#x6B63;&#x8981;&#x505A;&#x5B9E;&#x9A8C;&#xFF0C;&#x5374;&#x7A81;&#x7136;&#x53D1;&#x73B0;&#x7BA1;&#x5B50;&#x5DF2;&#x7ECF;&#x88AB;&#x90A3;&#x4E2A;&#x5BB6;&#x4F19;&#x7ED9;&#x526A;&#x4E86;&#xFF0C;&#x4E0D;&#x591F;&#x8DDD;&#x79BB;&#x554A;=&#x3002;= &#x4E8E;&#x662F;&#x6BCD;&#x4E0A;&#x53C8;&#x4E0D;&#x5F97;&#x4E0D;&#x4E0B;&#x53BB;&#x4E70;&#x4E86;&#x8DDF;&#x4E94;&#x5757;&#x94B1;&#x7684;&#x7BA1;&#x5B50;&#xFF0C;&#x76F4;&#x63D2;&#x4E0B;&#x6C34;&#x9053;&#xFF0C;&#x8131;&#x6C34;&#x5C31;&#x4E0D;&#x4F1A;&#x53CD;&#x6D8C;&#x4E86;&#x3002;&#x3002;&#x4F46;&#x662F;&#x56E0;&#x4E3A;&#x662F;&#x5927;&#x5174;&#x7684;&#x7BA1;&#x5B50;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x5B83;&#x6839;&#x672C;&#x65E0;&#x6CD5;&#x67D4;&#x97E7;&#x7684;&#x5F2F;&#x66F2;&#xFF0C;&#x6324;&#x538B;&#x4E4B;&#x4E0B;&#x5448;&#x4E0A;&#x626C;&#x7684;&#x8D8B;&#x52BF;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;&#x53EF;&#x80FD;&#x7BA1;&#x9053;&#x63A5;&#x53E3;&#x7684;&#x5BC6;&#x5EA6;&#x4E0D;&#x591F;&#x7D27;&#x81F4;&#xFF0C;&#x81F4;&#x4F7F;&#x5728;&#x6392;&#x6C34;&#x53E3;&#x7684;&#x8FDE;&#x63A5;&#x5904;&#x6709;&#x4E9B;&#x6EF4;&#x6C34;&#x3002;&#x3002;&#x3002;&#x3002; &#x771F;&#x662F;&#x592A;&#x626B;&#x5174;&#x4E86;&#xFF0C;&#x4E8E;&#x662F;&#x53EA;&#x597D;&#x53C8;&#x53BB;&#x7F51;&#x8DEF;&#x4E0A;&#x518D;&#x4E70;&#x4E00;&#x6839;&#x539F;&#x914D;&#x7684;&#x7BA1;&#x5B50;&#xFF0C;&#x53C8;&#x662F;&#x5341;&#x5757;&#xFF0C;&#x8FD8;&#x6709;&#x8FD0;&#x8D39;&#xFF0C;&#x8FD8;&#x4E0D;&#x77E5;&#x9053;&#x5230;&#x5E95;&#x597D;&#x4E0D;&#x597D;&#x7528;&#xFF0C;&#x8FD8;&#x8981;&#x518D;&#x6298;&#x817E;&#x4E00;&#x6B21;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;</p>
<p>&#x4E8B;&#x5DF2;&#x81F3;&#x6B64;&#xFF0C;&#x5E94;&#x8BE5;&#x662F;&#x5DEE;&#x4E0D;&#x591A;&#x4E86;&#xFF0C;&#x6BCD;&#x4E0A;&#x611F;&#x53F9;&#x65E9;&#x77E5;&#x9053;&#x8FD8;&#x662F;&#x6EDA;&#x7B52;&#x6D17;&#x8863;&#x673A;&#x597D;&#xFF0C;&#x6BCF;&#x6B21;&#x8981;&#x6362;&#x65B0;&#x4E8B;&#x7269;&#x7684;&#x65F6;&#x5019;&#x603B;&#x662F;&#x683C;&#x5916;&#x7684;&#x6298;&#x817E;&#x3002;&#x6211;&#x673A;&#x667A;&#x7684;&#x6478;&#x6478;&#x5979;&#x7684;&#x5934;&#xFF0C;&#x597D;&#x4E86;&#x597D;&#x4E86;&#xFF0C;&#x6298;&#x817E;&#x662F;&#x6298;&#x817E;&#x4E86;&#x4E00;&#x70B9;&#xFF0C;&#x597D;&#x5728;&#x65E7;&#x7684;&#x4E0D;&#x53BB;&#xFF0C;&#x65B0;&#x7684;&#x4E0D;&#x6765;&#x561B;&#xFF0C;&#x4EFB;&#x4F55;&#x7F8E;&#x597D;&#x7684;&#x65B0;&#x4E8B;&#x7269;&#xFF0C;&#x603B;&#x6709;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x75DB;&#x82E6;&#x7684;&#x66F4;&#x8FED;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x7236;&#x4E0A;&#x4E5F;&#x597D;&#x4F3C;&#x6273;&#x56DE;&#x4E00;&#x57CE;&#x4F3C;&#x5F97;&#x8FDE;&#x58F0;&#x9644;&#x548C;&#x3002;</p>
<br>
<p>&#x4F46;&#x5176;&#x5B9E;&#x6211;&#x5F88;&#x6127;&#x759A;&#x3002;&#x3002;&#x9996;&#x5148;&#x6CA1;&#x6709;&#x8003;&#x8651;&#x5230;&#x6C34;&#x52BF;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x968F;&#x4FBF;&#x6311;&#x4E86;&#x4E00;&#x4E2A;&#x5C31;&#x4E70;&#x597D;&#x50CF;&#x4E5F;<span style="color:#E53333;">&#x4E0D;&#x592A;&#x4E25;&#x8C28;</span>&#x3002;&#x5176;&#x6B21;&#x4E13;&#x4E1A;&#x7684;&#x4E1C;&#x897F;&#x8FD8;&#x662F;&#x5E94;&#x8BE5;&#x8BA9;&#x4E13;&#x4E1A;&#x7684;&#x4EBA;&#x6765;&#x88C5;&#xFF0C;&#x867D;&#x7136;&#x6211;&#x4E00;&#x76F4;&#x4E3B;&#x5F20;&#x8FD9;&#x4E2A;&#x9053;&#x7406;&#xFF0C;&#x4F46;&#x7236;&#x4E0A;call&#x6211;&#x7684;&#x65F6;&#x5019;&#x6211;&#x8FD8;&#x662F;&#x6015;&#x9EBB;&#x70E6;&#x60F3;&#x5F53;&#x7136;&#x7684;&#x4EE5;&#x4E3A;&#x6D17;&#x8863;&#x673A;&#x8FD9;&#x79CD;&#x667A;&#x5546;&#x7684;&#x4E1C;&#x897F;&#x5E94;&#x8BE5;&#x662F;&#x7EF0;&#x7EF0;&#x6709;&#x4F59;&#x7684;&#xFF0C;&#x6240;&#x4EE5;<span style="color:#E53333;">&#x4E0D;&#x591F;&#x575A;&#x51B3;</span>&#xFF0C;&#x7ED3;&#x679C;&#x8BA9;&#x7236;&#x4E0A;&#x8017;&#x65F6;&#x8017;&#x529B;&#x8FD8;&#x4E0D;&#x5F97;&#x597D;&#x5904;&#xFF1B;&#x60F3;&#x60F3;&#x540C;&#x6837;&#x662F;&#x8981;&#x7B49;&#x5230;&#x5468;&#x672B;&#x624D;&#x80FD;&#x6B63;&#x5F0F;&#x4F7F;&#x7528;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x4E13;&#x4E1A;&#x7684;&#x4EBA;&#x6765;&#x88C5;&#xFF0C;&#x90A3;&#x4E48;&#x4ED6;&#x4E00;&#x5B9A;&#x80FD;&#x591F;&#x53CA;&#x65F6;&#x7684;&#x53D1;&#x73B0;&#x6C34;&#x52BF;&#x9AD8;&#x4F4E;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x53CD;&#x6D8C;&#x4E86;&#x4E5F;&#x80FD;&#x591F;&#x9A6C;&#x4E0A;&#x7684;&#x82B1;&#x6700;&#x5C0F;&#x7684;&#x4EE3;&#x4EF7;&#x8C03;&#x6574;&#x5230;&#x4F4D;&#xFF0C;&#x4FDD;&#x8BC1;&#x4F7F;&#x7528;&#x3002;&#x54EA;&#x91CC;&#x50CF;&#x662F;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x8FD9;&#x6837;&#xFF0C;&#x82B1;&#x4E86;&#x51A4;&#x6789;&#x94B1;&#x4E0D;&#x8BF4;&#xFF0C;&#x8FD8;&#x6298;&#x817E;&#x4E86;&#x81EA;&#x5DF1;&#x3002;&#x3002;&#x6700;&#x540E;&#x662F;&#x5FC3;&#x6001;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x592A;&#x6025;&#x5207;&#x7684;&#x60F3;&#x8981;&#x5B8C;&#x6210;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x800C;&#x4E0D;&#x613F;&#x610F;&#x505A;&#x51FA;&#x5FC5;&#x8981;&#x7684;&#x7B49;&#x5F85;&#xFF0C;&#x5F80;&#x5F80;&#x662F;<span style="color:#E53333;">&#x6B32;&#x901F;&#x4E0D;&#x8FBE;&#xFF0C;&#x8D8A;&#x6025;&#x8D8A;&#x9519;&#xFF0C;&#x8D8A;&#x9519;&#x8D8A;&#x6025;&#x3002;</span></p>
<p>&#x60F3;&#x8D77;&#x4ECA;&#x5929;&#x770B;&#x5230;&#x8FC7;&#x7684;&#x4E00;&#x4E2A;&#x5173;&#x4E8E;&#x65C5;&#x884C;&#x7684;&#x5E16;&#x5B50;&#xFF0C;&#x5F88;&#x662F;&#x4F69;&#x670D;&#x90A3;&#x4E9B;&#x771F;&#x6B63;&#x80FD;&#x591F;&#x505A;&#x5230;&#x5FC3;&#x5982;&#x6B62;&#x6C34;&#x7684;&#x4EBA;&#x4EEC;&#xFF1B;&#x5F88;&#x662F;&#x559C;&#x6B22;&#x90A3;&#x4E00;&#x53E5;&#x8BD7;&#xFF0C;&#x6B64;&#x5FC3;&#x5B89;&#x5904;&#x662F;&#x543E;&#x4E61;&#x3002;</p>
<blockquote>
<p>&#x6211;&#x4E5F;&#x66FE;&#x5165;&#x85CF;&#xFF0C;&#x6240;&#x89C1;&#x6240;&#x95FB;&#x867D;&#x7136;&#x9707;&#x64BC;&#xFF0C;&#x53EF;&#x662F;&#x8BF4;&#x5230;&#x771F;&#x8C1B;&#xFF0C;&#x53EF;&#x771F;&#x662F;&#x65E0;&#x6CD5;&#x603B;&#x7ED3;&#x65E0;&#x6CD5;&#x8868;&#x8FBE;&#x3002;</p>
<p>&#x56DE;&#x5230;&#x4E3D;&#x6C5F;&#x540E;&#x63A5;&#x5F85;&#x6C99;&#x53D1;&#x5BA2;&#xFF0C;&#x6570;&#x6765;&#x4E5F;&#x6709;&#x767E;&#x5341;&#x6765;&#x4E2A;&#xFF0C;&#x6709;&#x63E3;&#x7740;&#x590D;&#x53E4;&#x4EA4;&#x5377;&#x76F8;&#x673A;&#x7684;&#x8C46;&#x74E3;&#x5973;&#x9752;&#x5E74;&#xFF0C;&#x6709;&#x65E5;&#x884C;80&#x516C;&#x91CC;&#x80E1;&#x5B50;&#x62C9;&#x78B4;&#x7684;&#x5F92;&#x6B65;&#x8005;&#xFF0C;&#x6709;&#x9A91;&#x6469;&#x6258;&#x73AF;&#x6E38;&#x4E2D;&#x56FD;&#x7684;&#x5927;&#x9F84;&#x672A;&#x5A5A;&#x5973;&#x9752;&#x5E74;&#xFF0C;&#x6709;&#x6D6E;&#x5938;&#x725B;&#x903C;&#x65C5;&#x9014;&#x7684;&#x80CC;&#x5305;&#x5BA2;&#x3002;</p>
<p>&#x5728;&#x4F17;&#x591A;&#x4EBA;&#x4E4B;&#x4E2D;&#xFF0C;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5973;&#x5B69;&#x771F;&#x6B63;&#x6253;&#x52A8;&#x8FC7;&#x6211;&#x3002;</p>
<p>&#x76AE;&#x80A4;&#x9EDD;&#x9ED1;&#xFF0C;&#x7A7F;&#x7740;&#x62D6;&#x978B;&#xFF0C;&#x4E00;&#x4E2A;&#x5B66;&#x751F;&#x5F0F;&#x7684;&#x4E66;&#x5305;&#xFF0C;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x6237;&#x5916;&#x8BBE;&#x5907;&#x548C;&#x76F8;&#x673A;&#x3002;</p>
<p>&#x7B7E;&#x8BC1;&#x5230;&#x671F;&#xFF0C;&#x5979;&#x4ECE;&#x5370;&#x5EA6;&#x56DE;&#x56FD;&#xFF0C;&#x91CD;&#x6E38;&#x4E91;&#x5357;&#xFF0C;&#x9664;&#x975E;&#x6211;&#x95EE;&#x5230;&#xFF0C;&#x5979;&#x4ECE;&#x4E0D;&#x4E3B;&#x52A8;&#x8C08;&#x81EA;&#x5DF1;&#x90A3;&#x4E9B;&#x65C5;&#x884C;&#x7684;&#x6545;&#x4E8B;&#x3002;</p>
<p>&#x5979;&#x5728;&#x56FD;&#x5185;&#x65C5;&#x6E38;&#x4E09;&#x5E74;&#xFF0C;&#x5728;&#x56FD;&#x5916;&#x4E03;&#x5E74;&#xFF0C;&#x7ECF;&#x8D39;&#x9760;&#x6253;&#x5DE5;&#x548C;&#x5BB6;&#x4E2D;&#x652F;&#x6301;&#x3002;&#x6709;&#x4E00;&#x4E2A;&#x745E;&#x58EB;&#x7684;&#x7537;&#x53CB;&#x3002;</p>
<p>&#x5979;&#x4E0D;&#x5199;&#x6E38;&#x8BB0;&#xFF0C;&#x4E0D;&#x62CD;&#x7167;&#x7247;&#xFF0C;&#x4E0A;&#x4E0A;&#x7F51;&#x53EA;&#x67E5;&#x67E5;&#x57FA;&#x7840;&#x7684;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x5979;&#x5750;&#x5728;&#x6211;&#x8EAB;&#x65C1;&#xFF0C;&#x6211;&#x5B8C;&#x5168;&#x80FD;&#x611F;&#x53D7;&#x5230;&#x5185;&#x5FC3;&#x7684;&#x5E73;&#x548C;&#x548C;&#x5B81;&#x9759;&#x3002;</p>
<p>&#x6DF1;&#x591C;&#xFF0C;&#x6211;&#x548C;&#x5979;&#x5750;&#x5728;&#x53E4;&#x57CE;&#x7684;&#x9662;&#x5B50;&#x91CC;&#x559D;&#x9152;&#x3002;</p>
<p>&#x6211;&#x95EE;&#x5979;&#xFF0C;&#x4F60;&#x53BB;&#x8FC7;&#x8FD9;&#x4E48;&#x591A;&#x5730;&#x65B9;&#xFF0C;&#x54EA;&#x91CC;&#x8BA9;&#x4F60;&#x611F;&#x89C9;&#x6700;&#x597D;&#xFF1F;</p>
<p>&#x5979;&#x8BF4;&#xFF0C;&#x54EA;&#x90FD;&#x597D;&#x5440;&#x3002;</p>
<p>&#x6211;&#x95EE;&#x5979;&#xFF0C;&#x4F60;&#x4F1A;&#x4E00;&#x76F4;&#x8FD9;&#x6837;&#x73A9;&#x4E0B;&#x53BB;&#x4E48;&#xFF1F;</p>
<p>&#x5979;&#x8BF4;&#xFF0C;&#x518D;&#x770B;&#x5427;&#x3002;</p>
<p>&#x6211;&#x95EE;&#x5979;&#xFF0C;&#x4F60;&#x51FA;&#x6765;&#x8FD9;&#x4E48;&#x4E45;&#xFF0C;&#x8D70;&#x8FC7;&#x8FD9;&#x4E48;&#x5730;&#x65B9;&#xFF0C;&#x6709;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x6DF1;&#x523B;&#x7684;&#x611F;&#x609F;&#x3002;</p>
<p>&#x5979;&#x8BF4;&#xFF0C;&#x54EA;&#x6709;&#x90A3;&#x4E48;&#x591A;&#x611F;&#x609F;&#xFF0C;&#x6211;&#x53EA;&#x662F;&#x60F3;&#x591A;&#x8D70;&#x8D70;&#x770B;&#x770B;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x6837;&#x633A;&#x6709;&#x610F;&#x601D;&#x7684;&#x3002;</p>
<p>&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x5E73;&#x548C;&#x7684;&#x5BF9;&#x8BDD;&#xFF0C;&#x5979;&#x662F;&#x6211;&#x81F3;&#x4ECA;&#x6700;&#x6B23;&#x8D4F;&#x7684;&#x65C5;&#x8005;&#x3002;</p>
<p>&#x54EA;&#x6709;&#x90A3;&#x4E48;&#x591A;&#x771F;&#x8C1B;&#x3002;</p>
<p>&#x5927;&#x97F3;&#x5E0C;&#x58F0;&#xFF0C;&#x5927;&#x8C61;&#x65E0;&#x5F62;&#x3002;<span style="color:#E53333;"> &#x5FC3;&#x4E2D;&#x5B89;&#x5B9A;&#x7684;&#x4EBA;&#xFF0C;&#x8D70;&#x5230;&#x54EA;&#x91CC;&#x90FD;&#x662F;&#x6625;&#x5929;&#x3002;</span></p>
</blockquote>
<br>
<p>&#x6700;&#x540E;&#x8DDF;&#x76F8;&#x4F34;&#x4E86;&#x5341;&#x591A;&#x5E74;&#x7684;&#x6EDA;&#x7B52;&#x6D17;&#x8863;&#x673A;&#x8BF4;&#x4E00;&#x58F0;&#xFF1A;&#x4F60;&#x8F9B;&#x82E6;&#x5566;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FD9;&#x79CD;&#x4E0D;&#x7B49;&#x4F60;&#x5149;&#x8363;&#x9000;&#x5F79;&#x5C31;&#x559C;&#x65B0;&#x538C;&#x65E7;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x6211;&#x4EEC;&#x6DF1;&#x8868;&#x6B49;&#x610F;!</p>

            </div>

            
            <section class="reward">
                <!-- Donate Module -->
<div id="donate_module">
    <style type="text/css">
        .hidden {
            display: none;
        }
        .donate_bar a.btn_donate {
            display: inline-block;
            width: 82px;
            height: 82px;
            background: url("http://img.t.sinajs.cn/t5/style/images/apps_PRF/e_media/btn_reward.gif") no-repeat;
            _background: url("http://img.t.sinajs.cn/t5/style/images/apps_PRF/e_media/btn_reward.gif") no-repeat;

            -webkit-transition: background 0s;
            -moz-transition: background 0s;
            -o-transition: background 0s;
            -ms-transition: background 0s;
            transition: background 0s;
        }
        .donate_bar a.btn_donate:hover {
            background-position: 0 -82px;
        }
        .donate_bar .donate_txt {
            display: block;
            color: #9d9d9d;
            font: 14px/2 "Microsoft Yahei";
        }
        .bold {
            font-weight: bold;
        }

        img.qrcode {
            width: 90%;
            margin-bottom: 10px;
        }
        @media only screen and (min-width: 1025px) {
            img.qrcode {
                width: 40%;
                margin-right: 10px;
            }
        }

    </style>

    <!-- btn_donate & tips -->
    <div id="donate_board" class="donate_bar center">
        <a id="btn_donate" class="btn_donate" target="_self" href="javascript:;" title="Donate 打赏"></a>
        <span class="donate_txt">看完啦? 够意思!  土豪~交个朋友吧...</span>
    </div>
    <!-- /btn_donate & tips -->

    <!-- donate guide -->
    <div id="donate_guide" class="donate_bar center hidden">
        
        <img class="qrcode" src="http://7xr6h2.com1.z0.glb.clouddn.com/alipay.png" title="打赏"/>
        
        <img class="qrcode" src="http://7xr6h2.com1.z0.glb.clouddn.com/wechatMe.png" title="打赏"/>
        
    </div>
    <!-- /donate guide -->

    <!-- donate script -->
    <script type="text/javascript">
        document.getElementById('btn_donate').onclick = function() {
            $('#donate_board').addClass('hidden');
            $('#donate_guide').removeClass('hidden');
        }

        function donate_on_web() {
            $('#donate').submit();
        }
    </script>
    <!-- /donate script -->
</div>
<!-- /Donate Module -->

            </section>
            

            <!-- 阅读量 -->
            <span id="busuanzi_container_page_pv">
            <i class="fa fa-eye"></i>
                文章阅读量 <span id="busuanzi_value_page_pv" style="color:indigo">-link-context"></span>次
            </span>
        </div>
    </div>
</article>




    <section id="comment">
        <div class="card">
            <div class="card-content">
                <!-- Duoshuo Comment BEGIN -->
                <div class="ds-thread" data-thread-key="goodbye-drum-washing-machine" data-title="告别滚筒洗衣机" data-url="http://jkissday.online/goodbye-drum-washing-machine/"></div>
                <script type="text/javascript">
                    var duoshuoQuery = {
                        short_name: 'jkissday'
                    };
                    (function() {
                        var ds = document.createElement('script');
                        ds.type = 'text/javascript';
                        ds.async = true;
                        ds.src = (document.location.protocol == 'https:'
                            ? 'https:'
                            : 'http:') + '//static.duoshuo.com/embed.js';
                        ds.charset = 'UTF-8';
                        (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(ds);
                    })();
                </script>
                <!-- Duoshuo Comment END -->
            </div>
        </div>
    </section>


<!--友言-->
<!--&lt;!&ndash; UY BEGIN &ndash;&gt;-->
<!--<div id="uyan_frame"></div>-->
<!--<script type="text/javascript" src="http://v2.uyan.cc/code/uyan.js?uid=2094227"></script>-->
<!--&lt;!&ndash; UY END &ndash;&gt;-->

</div>

        <div class="fixed-action-btn float-sitemap">
    <a class="btn-floating btn-large green">
      <i class="fa fa-caret-square-o-up"></i>
    </a>
    <ul>
      <li><a class="btn-return-top btn-floating waves-effect blue" title="回到顶部"><i class="fa fa-arrow-circle-o-up"></i></a></li>
      <li><a class="btn-floating waves-effect button-collapse orange"  data-activates="main-menu" title="菜单"><i class="fa fa-navicon"></i></a></li>
    </ul>
  </div>

    </main>
    <footer class="page-footer indigo darken-1">
    
    <div class="container">
        <div class="row">
            
            <div class="social-group col m4 s12">
                <h5 class="white-text">社交</h5>
                
                    <a class="social-link" href="http://weibo.com/hydra7249" target="_blank">
                        <i class="fa fa-2x fa-weibo"></i>
                    </a>
                
                    <a class="social-link" href="http://www.douban.com/people/36529994/" target="_blank">
                        <i class="fa fa-2x fa-star-half-o"></i>
                    </a>
                
                    <a class="social-link" href="https://twitter.com/hydra7249" target="_blank">
                        <i class="fa fa-2x fa-twitter"></i>
                    </a>
                
                    <a class="social-link" href="https://www.pinterest.com/snowvivi/" target="_blank">
                        <i class="fa fa-2x fa-pinterest"></i>
                    </a>
                
                    <a class="social-link" href="https://github.com/olddoggie" target="_blank">
                        <i class="fa fa-2x fa-github"></i>
                    </a>
                
                    <a class="social-link" href="/atom.xml" target="_blank">
                        <i class="fa fa-2x fa-rss"></i>
                    </a>
                
            </div>
            

            
            <div class="col m8 s12">
                <h5 class="white-text">友情链接</h5>
                
                    <a class="social-link" href="http://foredoomed.org/" target="_blank">Zhixingheyi</a>
                
                    <a class="social-link" href="http://blog.sina.com.cn/rokgy" target="_blank">rokgy的博客</a>
                
                    <a class="social-link" href="http://www.dandyweng.com/" target="_blank">dandyweng的博客</a>
                
                    <a class="social-link" href="https://xiaolife.com/" target="_blank">Life Journal</a>
                
                    <a class="social-link" href="http://www.netcan666.com/" target="_blank">Netcan</a>
                
            </div>
            
        </div>
    </div>
    


    <div class="footer-copyright indigo-link-context">
        <div class="container">
            <div class="row">
                <div class="col m4 s12">
                    © 2016 jkissday.online, All rights reserved.
                </div>
                <div class="col m8 s12">
                    <i class="fa fa-rocket"></i> Hexo | 主题 raytaylorism
                    | 总字数 <span>67.3k</span>
                    | 总访问量 <span id="busuanzi_value_site_pv"></span> |
                    访客人次 <span id="busuanzi_value_site_uv"></span> |
                    页点击量 <span id="busuanzi_value_page_pv"></span>
                </div>
            </div>
        </div>
    </div>

    <script async src="https://dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js">
    </script>
</footer>


    <noscript>
    <div class="noscript">
        <p class="center-align">当前浏览器不支持博客完整功能。如果要获得最佳体验，请点击右上角···，复制链接，并在其它浏览器打开</p>
    </div>
</noscript>
<div class="noscript">
    <p class="center-align">当前浏览器不支持博客完整功能。如果要获得最佳体验，请点击右上角···，复制链接，并在其它浏览器打开</p>
</div>


<script src="/js/jquery-2.1.1.min.js"></script>
<script src="/js/materialize.min.js"></script>
<script src="/js/search.js"></script>

<script>
(function($) {
    $(document).ready(function() {
        // 隐藏禁用javascript（针对微信内置浏览器）的提示
        $('.noscript').hide();

        // 图片缩放效果
        var $imgs = $('img').not('.slider-image').not('.avatar-image').not('.carousel-image').not('.card-cover-image').not('.qrcode');

        // 给图片加上点击放大效果（materialbox插件）
        $imgs.addClass('materialboxed')
            .each(function(i, el) {
                $(this).attr('data-caption', $(this).attr('alt') || ' ');
            }).materialbox();

        // 首页幻灯片
        $('.slider').slider({
            indicators: true,
            full_width: true,
            interval: 8000
        });

        $(".button-collapse").sideNav();
        $(".category-menu").sideNav();

        // 针对gallery post
        $('.carousel').carousel({
            full_width: true
        });
        $('.carousel-control.prev').click(function() {
            $('.carousel').carousel('prev');
        });
        $('.carousel-control.next').click(function() {
            $('.carousel').carousel('next');
        });

        // 文章目录
        $('article').not('.simple-article').find('h1').add('h2').add('h3').add('h4').add('h5').add('h6').scrollSpy();
        // 修正文章目录的left-border颜色
        var color = $('.table-of-contents-text').css('color');
        $('.table-of-contents-link').css('border-left-color', color);

        // 针对移动端做的优化：FAB按钮点击一下收回
        if (/Android|webOS|iPhone|iPad|iPod|BlackBerry|IEMobile|Opera Mini/i.test(navigator.userAgent)) {
            $('.fixed-action-btn').addClass('click-to-toggle');
        }
        // 回到顶部
        $('.btn-return-top').click(function() {
            $('body, html').animate({
                scrollTop: 0
            }, 500);
        });

        // 重置读书页面的Tab标签页的颜色
        $('li.tab a').hover(function() {
            $(this).toggleClass('text-lighten-4');
        });
        $('.indicator').addClass('green lighten-2');

        
        // 添加new标签
        $('.menu-reading').append('<span class="new badge pink"></span>');
        
    });
})(jQuery);
</script>


<script src="/js/prettify.js"></script>
<script type="text/javascript">
    $(document).ready(function() {
        $("pre").addClass("prettyprint");
        prettyPrint();
    });
</script>






<script type="text/x-mathjax-config">
MathJax.Hub.Config({
  tex2jax: {inlineMath: [['$','$'], ['\\(','\\)']]}
});
</script>
<script type="text/javascript"
    src="http://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML">
</script>



<script type="text/javascript">
    var search_path = "search.xml";
    if (search_path.length == 0) {
        search_path = "search.xml";
    }
    var path = "/" + search_path;
    searchFunc(path, 'local-search-input', 'local-search-result');
</script>
</body>
</html>
