<!DOCTYPE HTML>
<html>
<head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="chrome=1">
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no">

    

    <title>记第22届上大菊花展及Rokgy&#39;s Home一日游 | 我爱夏雪天</title>
    <meta name="author" content="Jack Wang">
    
    <meta name="description" content="长啸一声会有时!">
    
    
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

    <meta property="og:title" content="记第22届上大菊花展及Rokgy&#39;s Home一日游"/>
    <meta property="og:site_name" content="我爱夏雪天"/>

    
    <meta property="og:image" content="undefined"/>
    

    <link rel="icon" type="image/png" href="/favicon.png">
    <link rel="alternate" href="/atom.xml" title="我爱夏雪天" type="application/atom+xml">
    <link rel="stylesheet" href="/css/lib/materialize.min.css">
    <link rel="stylesheet" href="/css/lib/font-awesome.min.css">
    <link rel="stylesheet" href="/css/style.css" media="screen" type="text/css">

    
        <link rel="stylesheet" href="/css/lib/prettify-tomorrow-night-eighties.css" type="text/css">
    
    <!--[if lt IE 9]><script src="//html5shiv.googlecode.com/svn/trunk/html5.js"></script><![endif]-->
</head>


<body>
    <div id="loadingDiv" style="position:fixed;display:none;z-index:2000;top:0px;left:0px;width:100%;height:100%;background-color:white"></div>

    <img src="/weixin_favicon.png" style="position: absolute; left: -9999px; opacity: 0; filter: alpha(opacity=0);">

    <nav class="indigo">
    <div class="nav-wrapper">
        <a href="#" data-activates="main-menu" class="button-collapse">
            <i class="fa fa-navicon"></i>
        </a>
        <div class="">
            <a href="/" class="brand-logo hide-on-med-and-down">我爱夏雪天</a>
            <ul class="right hide-on-med-and-down">
                
                    <li>
                        <a class="menu-home " href="/" >
                            <i class="fa fa-home "></i>
                            首页
                        </a>
                    </li>
                
                    <li>
                        <a class="menu-archive " href="/archives" >
                            <i class="fa fa-archive "></i>
                            归档
                        </a>
                    </li>
                
                    <li>
                        <a class="menu-category category-menu" href="javascript:;" data-activates="category-menu" >
                            <i class="fa fa-bookmark "></i>
                            分类
                        </a>
                    </li>
                
                    <li>
                        <a class="menu-reading " href="/reading" >
                            <i class="fa fa-book "></i>
                            收藏
                        </a>
                    </li>
                
                    <li>
                        <a class="menu-about " href="/about" >
                            <i class="fa fa-user "></i>
                            关于
                        </a>
                    </li>
                
            </ul>
            <div>
    <ul class="side-nav indigo darken-1" id="main-menu">
        
        <li class="side-user">
            <div class="row">
                <div class="col s4 no-padding">
                    <img class="avatar-image circle responsive-img" src="http://7xr6h2.com1.z0.glb.clouddn.com/avataryin.jpg" alt="User Avatar">
                </div>
                <div class="info col s8 valign-wrapper no-padding">
                    <div class="valign">
                        <p class="name">Jack.Wang</p>
                        <p class="desc">单线程 | 程序猿</p>
                    </div>
                </div>
            </div>
        </li>
        

        
            <li class="no-padding">
                <a class="waves-effect menu-home " href="/" >
                    <i class="fa fa-home "></i>
                    首页
                </a>
            </li>
        
            <li class="no-padding">
                <a class="waves-effect menu-archive " href="/archives" >
                    <i class="fa fa-archive "></i>
                    归档
                </a>
            </li>
        
            <li class="no-padding">
                <a class="waves-effect menu-category category-menu" href="javascript:;" data-activates="category-menu" >
                    <i class="fa fa-bookmark "></i>
                    分类
                </a>
            </li>
        
            <li class="no-padding">
                <a class="waves-effect menu-reading " href="/reading" >
                    <i class="fa fa-book "></i>
                    收藏
                </a>
            </li>
        
            <li class="no-padding">
                <a class="waves-effect menu-about " href="/about" >
                    <i class="fa fa-user "></i>
                    关于
                </a>
            </li>
        
        <li class="no-padding">
            <a class="waves-effect menu-camera " href="/photo">
                <i class="fa fa-camera"></i>
                照片墙
            </a>
        </li>
        <li class="no-padding">
            <a class="waves-effect menu-rocket" href="/timeRocket">
                <i class="fa fa-rocket"></i>
                时间轴
            </a>
        </li>
        <li class="no-padding">
            <a class="waves-effect menu-home " href="/search">
                <i class="fa fa-search"></i>
                搜索
            </a>
        </li>
        <li class="no-padding">
            <a class="waves-effect menu-home " href="http://changyan.kuaizhan.com/stat-data/comment" target="_blank">
                <i class="fa fa-comments"></i>
                评论
            </a>
        </li>
        <li class="no-padding">
            <a class="waves-effect menu-reddit " href="https://wanqu.co" target="_blank">
                <i class="fa fa-reddit"></i>
                湾区日报
            </a>
        </li>
        <li class="no-padding">
            <a class="waves-effect menu-globe " href="http://www.thepaper.cn/list_25600" target="_blank">
                <i class="fa fa-globe"></i>
                热点快看
            </a>
        </li>
        <li class="no-padding">
            <a class="waves-effect menu-home " href="/">
                <i class="fa fa-fire"></i>
                彩蛋
            </a>
        </li>
    </ul>

    <ul class="side-nav indigo darken-1" id="category-menu">
        <!--<li class="">
            <h5 class="black-text">分类目录</h5>
        </li>-->

    

            

            <li class="collapse-level-0" collapse-level="0">
                <a class="no-padding" href="/categories/生活/">
                    生活 <span class="right">21 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-1" collapse-level="1">
                <a class="no-padding" href="/categories/生活/private/">
                    private <span class="right">4 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-0" collapse-level="0">
                <a class="no-padding" href="/categories/工作/">
                    工作 <span class="right">5 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-0" collapse-level="0">
                <a class="no-padding" href="/categories/技术/">
                    技术 <span class="right">8 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-1" collapse-level="1">
                <a class="no-padding" href="/categories/技术/测试/">
                    测试 <span class="right">2 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-1" collapse-level="1">
                <a class="no-padding" href="/categories/技术/工具/">
                    工具 <span class="right">1 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-1" collapse-level="1">
                <a class="no-padding" href="/categories/技术/web/">
                    web <span class="right">2 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-1" collapse-level="1">
                <a class="no-padding" href="/categories/技术/linux/">
                    linux <span class="right">2 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-1" collapse-level="1">
                <a class="no-padding" href="/categories/技术/数据库/">
                    数据库 <span class="right">1 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-0" collapse-level="0">
                <a class="no-padding" href="/categories/体育/">
                    体育 <span class="right">1 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-0" collapse-level="0">
                <a class="no-padding" href="/categories/艺术/">
                    艺术 <span class="right">8 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-1" collapse-level="1">
                <a class="no-padding" href="/categories/艺术/书籍/">
                    书籍 <span class="right">2 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-1" collapse-level="1">
                <a class="no-padding" href="/categories/艺术/音乐/">
                    音乐 <span class="right">5 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-1" collapse-level="1">
                <a class="no-padding" href="/categories/艺术/电影/">
                    电影 <span class="right">1 篇</span></a>
                </a>
            </li>

        

            <li class="collapse-level-0" collapse-level="0">
                <a class="no-padding" href="/categories/旅行/">
                    旅行 <span class="right">2 篇</span></a>
                </a>
            </li>

        

    </ul>
</div>
        </div>
    </div>
</nav>

    <main>
        <div class="container main-container">
    

<nav class="page-nav hide-on-small-only">
    <div class="nav-wrapper indigo">
        <span class="breadcrumb">当前位置（目录）</span>
        
            
    
    
    <a class="breadcrumb" href="/categories/生活/">生活</a>


        

        
    </div>
</nav>

<article>
    <div class="card">
        <div class="card-content">
            

            <div class="article-title">
                
    
        <h1>记第22届上大菊花展及Rokgy&#39;s Home一日游</h1>
    


            </div>
            <span class="grey-text">发表于</span>
            <time class="indigo-link-context" datetime="2014-11-30T15:00:56.000Z"><a href="/visit-rokgy-home/">2014-11-30</a></time>

            <span class="grey-text"> | 字数</span>
            <span class="indigo-link-context"><a href="/visit-rokgy-home/">1,363</a></span>
            <span class="grey-text"> | 预计阅读时间</span>
            <span class="indigo-link-context"><a href="/visit-rokgy-home/">9分钟</a></span>
            
    <div class="tags-row">
        
            <a href="/tags/Rokgy/" class="chip green accent-4">Rokgy</a>
        
            <a href="/tags/菊花展/" class="chip green accent-4">菊花展</a>
        
    </div>


            <div class="toc indigo-link-context hide-on-med-and-down">
    
</div>


            <div class="entry indigo-link-context">
                <p>&#x7EC8;&#x4E8E;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x4E0D;&#x52A0;&#x73ED;&#x7684;&#x5468;&#x672B;&#xFF0C;&#x51E0;&#x4E2A;&#x4EBA;&#x5982;&#x7EA6;&#x53BB;&#x4E86;&#x4E0A;&#x6D77;&#x5927;&#x5B66;&#x83CA;&#x82B1;&#x5C55;&#xFF0C;&#x987A;&#x8DEF;&#x548C;Rokgy&#x592B;&#x5987;&#x805A;&#x4E86;&#x6B21;&#x9910;&#xFF0C;&#x4E5F;&#x62DC;&#x8BBF;&#x4E86;&#x4ED6;&#x4EEC;&#x7684;&#x65B0;&#x5C45;&#x3002;</p>
<p>Rokgy&#x7684;&#x5BB6;&#x5E03;&#x7F6E;&#x7684;&#x5F88;&#x662F;&#x7B80;&#x6D01;&#x5E72;&#x51C0;&#xFF0C;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x5938;&#x5F20;&#x7684;&#x591A;&#x4F59;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4F46;&#x5374;&#x5145;&#x6EE1;&#x4E86;&#x5BB6;&#x7684;&#x6C14;&#x606F;&#xFF0C;&#x5BA2;&#x5385;&#x7684;&#x4E00;&#x89D2;&#x5750;&#x843D;&#x4E00;&#x5C0A;&#x5927;&#x5927;&#x7684;&#x7D2B;&#x6C34;&#x6676;&#xFF0C;&#x5BD3;&#x610F;&#x7740;&#x7D2B;&#x6C14;&#x4E1C;&#x6765;&#x3002;&#x4E66;&#x67B6;&#x4E0A;&#x7684;&#x6728;&#x5076;&#x6446;&#x8BBE;&#xFF0C;&#x968F;&#x5904;&#x53EF;&#x89C1;&#x7684;&#x5154;&#x5B50;logo&#xFF0C;&#x6696;&#x8272;&#x7684;&#x53F6;&#x5B50;&#x56FE;&#x6587;&#x5899;&#x7EB8;&#xFF0C;&#x90FD;&#x5F70;&#x663E;&#x7740;&#x6367;&#x54CF;&#x7684;&#x60C5;&#x8DA3;&#x3002;</p>
<p>&#x5F85;&#x6211;&#x4EEC;&#x5750;&#x5B9A;&#xFF0C;&#x5979;&#x9887;&#x6709;&#x5174;&#x81F4;&#x7684;&#x5411;&#x6211;&#x4EEC;&#x4ECB;&#x7ECD;&#x4E86;Panasonic &#x7684;&#x53D8;&#x8272;&#x540A;&#x706F;&#xFF0C;&#x770B;&#x7740;&#x4E0D;&#x65AD;&#x53D8;&#x5316;&#x7684;&#x8272;&#x5F69;&#xFF0C;&#x50CF;&#x4E2A;&#x5C0F;&#x5973;&#x5B69;&#x4E00;&#x6837;&#x7684;&#x5F00;&#x5FC3;&#x96C0;&#x8DC3;&#xFF0C;&#x800C;&#x59D0;&#x592B;&#x5219;&#x6C38;&#x8FDC;&#x662F;&#x4E00;&#x5F20;&#x51B7;&#x5CFB;&#x7684;&#x8138;&#xFF0C;&#x65F6;&#x4E0D;&#x65F6;&#x4E00;&#x672C;&#x6B63;&#x7684;&#x8BF4;&#x51FA;&#x4E00;&#x4E9B;&#x5728;&#x6211;&#x4EEC;&#x542C;&#x6765;&#x5F88;&#x6ED1;&#x7A3D;&#x7684;&#x8BDD;&#xFF0C;&#x53EA;&#x662F;&#x5230;&#x5934;&#x6765;&#x6211;&#x4EEC;&#x90FD;&#x89C9;&#x5F97;&#x5F88;&#x641E;&#x7B11;&#xFF0C;&#x59D0;&#x592B;&#x81EA;&#x5DF1;&#x5374;&#x4E00;&#x70B9;&#x4E0D;&#x89C9;&#x5F97;&#x7684;&#x6837;&#x5B50;&#xFF0C;&#x7EE7;&#x7EED;&#x4FDD;&#x6301;&#x4E25;&#x8083;&#x7684;&#x8868;&#x60C5;&#xFF0C;&#x4E8E;&#x662F;&#x6574;&#x4E2A;&#x573A;&#x9762;&#x5C31;&#x66F4;&#x52A0;&#x7684;&#x6ED1;&#x7A3D;&#x3002;&#x6211;&#x4EEC;&#x7BA1;&#x8FD9;&#x4E2A;&#x53EB;&#x505A;&#x51B7;&#x9762;&#x6ED1;&#x7A3D;&#x3002;</p>
<p>&#x8BF4;&#x6765;&#x771F;&#x662F;&#x6709;&#x8DA3;&#xFF0C;&#x4E00;&#x4E2A;&#x5F88;&#x5C11;&#x8A00;&#x7B11;&#x7684;&#x4EBA;&#x7684;&#x5BB6;&#x91CC;&#xFF0C;&#x4F4F;&#x7740;&#x4E00;&#x4E2A;&#x5F88;&#x662F;&#x6709;&#x8DA3;&#x7684;&#x6367;&#x54CF;&#xFF0C;&#x6367;&#x54CF;&#x5728;&#x59D0;&#x592B;&#x7684;&#x65C1;&#x8FB9;&#x5C0F;&#x9E1F;&#x4F9D;&#x4EBA;&#xFF0C;&#x8A00;&#x542C;&#x8BA1;&#x4ECE;&#xFF0C;&#x7A81;&#x7136;&#x5C31;&#x8C03;&#x76AE;&#x7684;&#x8C03;&#x620F;&#x4E0B;&#x59D0;&#x592B;&#xFF1B;&#x59D0;&#x592B;&#x5462;&#xFF0C;&#x5219;&#x6C38;&#x8FDC;&#x4E00;&#x5F20;&#x6251;&#x514B;&#x8138;&#xFF0C;&#x8BF4;&#x7740;&#x4E00;&#x4E9B;&#x4E25;&#x8083;&#x7684;&#x8BDD;&#xFF0C;&#x5374;&#x5F15;&#x5F97;&#x6367;&#x54CF;&#x548C;&#x6211;&#x4EEC;&#x54C8;&#x54C8;&#x5927;&#x7B11;&#x3002;&#x5927;&#x5BB6;&#x5403;&#x5403;&#x575A;&#x679C;&#xFF0C;&#x559D;&#x559D;&#x666E;&#x6D31;&#x8336;&#xFF0C;&#x65F6;&#x5149;&#x5728;&#x8FD9;&#x4E2A;&#x6E29;&#x99A8;&#x7684;&#x5BB6;&#x91CC;&#x5FEB;&#x901F;&#x6D41;&#x8FC7;&#x2026;&#x2026;</p>
<a id="more"></a>
<hr>
<p>&#x8336;&#x8FC7;&#x4E09;&#x5DE1;&#xFF0C;&#x5927;&#x5BB6;&#x8D77;&#x8EAB;&#x53BB;&#x4E86;&#x4E0A;&#x5927;&#x3002;&#x5929;&#x516C;&#x4F5C;&#x7F8E;&#xFF0C;&#x5C0F;&#x96E8;&#x70B9;&#x5C31;&#x662F;&#x6CA1;&#x6709;&#x51FA;&#x6765;&#x6363;&#x4E71;&#xFF0C;&#x6CA1;&#x6709;&#x8F9C;&#x8D1F;&#x8FD9;&#x53EF;&#x80FD;&#x662F;&#x6700;&#x540E;&#x4E00;&#x5E74;&#x7684;&#x83CA;&#x82B1;&#x5C55;&#x3002;&#x636E;Kevin&#x5927;&#x54E5;&#x8BF4;&#xFF0C;&#x7531;&#x4E8E;&#x592A;&#x8FC7;&#x94FA;&#x5F20;&#x6D6A;&#x8D39;&#xFF0C;&#x6240;&#x4EE5;&#x672C;&#x6765;&#x7684;&#x83CA;&#x82B1;&#x5C55;&#x8C8C;&#x4F3C;&#x5DF2;&#x7ECF;&#x4E0D;&#x600E;&#x4E48;&#x5141;&#x8BB8;&#x529E;&#x4E86;&#xFF0C;&#x4E5F;&#x8BB8;&#x660E;&#x5E74;&#x5C31;&#x6CA1;&#x4E86;&#x3002;&#x4F46;&#x597D;&#x5728;&#x6211;&#x4EEC;&#x7B97;&#x662F;&#x8D76;&#x4E0A;&#x4E86;&#x672B;&#x73ED;&#x8F66;&#xFF0C;&#x5927;&#x5BB6;&#x8BF4;&#x8BF4;&#x7B11;&#x7B11;&#xFF0C;&#x4ECE;&#x56FE;&#x4E66;&#x9986;&#x5230;&#x6B63;&#x95E8;&#x7684;&#x4E00;&#x5927;&#x6BB5;&#x76F4;&#x8DEF;&#x4E24;&#x8FB9;&#x7684;&#x83CA;&#x82B1;&#xFF0C;&#x5728;&#x9634;&#x51B7;&#x7684;&#x5929;&#x6C14;&#x91CC;&#x5A07;&#x8273;&#x7684;&#x50B2;&#x7ACB;&#xFF0C;&#x51D1;&#x8FD1;&#x4E86;&#x8FD8;&#x80FD;&#x95FB;&#x5230;&#x9635;&#x9635;&#x9999;&#x6C14;&#x3002;&#x8DEF;&#x8FC7;&#x7684;&#x5404;&#x79CD;&#x7CBE;&#x5FC3;&#x5E03;&#x7F6E;&#x7684;&#x83CA;&#x82B1;&#x7C07;&#xFF0C;&#x59D0;&#x592B;&#x5C31;&#x5F00;&#x59CB;&#x6307;&#x6325;&#x7740;&#x6211;&#x4EEC;&#x6446;pose&#xFF0C;&#x8D77;&#x5148;&#x662F;&#x5408;&#x7167;&#xFF0C;&#x4E3A;&#x4E86;&#x628A;&#x5927;&#x5BB6;&#x88C5;&#x8FDB;&#x4E0A;&#x5927;&#x56FE;&#x4E66;&#x9986;&#x7684;&#x5B8F;&#x4F1F;&#x80CC;&#x666F;&#x91CC;&#x9762;&#xFF0C;&#x771F;&#x662F;&#x8D39;&#x4E86;&#x4E00;&#x756A;&#x6CE2;&#x6298;&#x3002;&#x540E;&#x6765;&#x51E0;&#x4E2A;&#x5C0F;&#x59D1;&#x5E74;&#x5C31;&#x6E10;&#x6E10;&#x75AF;&#x4E86;&#x8D77;&#x6765;&#xFF0C;&#x8981;&#x59D0;&#x592B;&#x5E2E;&#x5979;&#x4EEC;&#x62CD;&#x5404;&#x79CD;&#x9020;&#x578B;&#xFF0C;&#x59D0;&#x592B;&#x4E0D;&#x538C;&#x5176;&#x70E6;&#x53C8;&#x4E00;&#x4E1D;&#x4E0D;&#x82DF;&#xFF0C;&#x4E13;&#x6CE8;&#x7684;&#x505A;&#x5927;&#x5BB6;&#x7684;&#x6444;&#x5F71;&#x5E08;&#xFF0C;&#x5E72;&#x51C0;&#x5229;&#x843D;&#xFF0C;&#x5341;&#x5206;&#x6709;&#x903C;&#x683C;&#x3002;</p>
<p>&#x83CA;&#x82B1;&#x548C;&#x843D;&#x53F6;&#x4E00;&#x8D77;&#x7EF5;&#x5EF6;&#x5728;&#x79CB;&#x8272;&#x5C3D;&#x5934;&#x3002;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x53BB;&#x4E86;&#x7F8E;&#x672F;&#x9986;&#xFF0C;&#x6714;&#x56ED;&#xFF0C;&#x6CBF;&#x7740;&#x5C0F;&#x5475;&#x770B;&#x5230;&#x7EA2;&#x9CA4;&#x9C7C;&#x3001;&#x5927;&#x767D;&#x9E45;&#x3001;&#x548C;&#x4E00;&#x53EA;&#x6CA1;&#x6709;&#x5F00;&#x5C4F;&#x7684;&#x4F18;&#x96C5;&#x5B54;&#x96C0;&#xFF0C;&#x6700;&#x7EC8;&#x7A7F;&#x8D8A;&#x94F6;&#x674F;&#x9053;&#xFF0C;&#x6765;&#x5230;&#x9ED1;&#x6697;&#x6599;&#x7406;&#x4E00;&#x6761;&#x8857;&#x3002;&#x4E00;&#x4E2A;&#x4E0B;&#x5348;&#x7684;&#x65F6;&#x5149;&#xFF0C;&#x611F;&#x89C9;&#x50CF;&#x662F;&#x9694;&#x4E86;&#x597D;&#x4E45;&#x7684;&#x8001;&#x53CB;&#x805A;&#x4F1A;&#x4E00;&#x6837;&#x6E29;&#x99A8;&#x800C;&#x53C8;&#x8212;&#x9002;&#xFF0C;&#x5176;&#x5B9E;&#x5927;&#x5BB6;&#x4E0A;&#x4E2A;&#x6708;&#x624D;&#x521A;&#x805A;&#x8FC7;&#xFF0C;&#x53EA;&#x662F;&#x8FD9;&#x6B21;&#x591A;&#x4E86;&#x4E2A;&#x4E25;&#x8083;&#x7684;&#x59D0;&#x592B;&#x3002;</p>
<hr>
<p>&#x56DE;&#x60F3;&#x6211;&#x4EEC;&#x4E2D;&#x7684;&#x5927;&#x591A;&#x6570;&#x4EBA;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x8D77;&#x5DE5;&#x4F5C;&#x800C;&#x8BA4;&#x8BC6;&#x4E86;&#xFF0C;&#x603B;&#x5171;&#x4E5F;&#x5C31;2&#x5230;3&#x5E74;&#x7684;&#x5149;&#x666F;&#xFF0C;&#x8FD8;&#x4E0D;&#x7B97;&#x6211;&#x3001;Kevin&#x5DF2;&#x7ECF;&#x79BB;&#x5F00;&#x4E86;&#x597D;&#x4E9B;&#x65E5;&#x5B50;&#x3002;&#x6211;&#x4EEC;&#x5F53;&#x65F6;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8D1F;&#x8D23;&#x4E0D;&#x540C;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x505A;&#x4E0D;&#x540C;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x50CF;&#x4E0D;&#x540C;&#x7684;&#x4E0A;&#x53F8;&#x6C47;&#x62A5;&#x3002;&#x5728;&#x7EA6;&#x83AB;&#x4E00;&#x5E74;&#x591A;&#x4EE5;&#x524D;&#xFF0C;&#x5927;&#x5BB6;&#x53EA;&#x662F;&#x666E;&#x901A;&#x7684;&#x540C;&#x4E8B;&#x5173;&#x7CFB;&#x800C;&#x5DF2;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x592A;&#x5927;&#x7684;&#x79C1;&#x4E0B;&#x4EA4;&#x96C6;&#x3002;&#x90A3;&#x662F;&#x4EC0;&#x4E48;&#x8BA9;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x50CF;&#x8001;&#x53CB;&#x4E00;&#x6837;&#x7684;&#x805A;&#x4F1A;&#xFF0C;&#x8086;&#x610F;&#x7684;&#x5BF9;&#x5F7C;&#x6B64;&#x8BC4;&#x5934;&#x8BBA;&#x8DB3;&#x8C08;&#x7B11;&#x98CE;&#x751F;&#x5462;&#xFF1F;</p>
<p>&#x601D;&#x8003;&#x4E86;&#x5F88;&#x4E45;&#xFF0C;&#x611F;&#x89C9;&#x4E00;&#x5207;&#x5E94;&#x8BE5;&#x90FD;&#x662F;&#x5728;&#x6211;&#x5373;&#x5C06;&#x79BB;&#x5F00;&#xFF0C;&#x548C;&#x79BB;&#x5F00;&#x4E4B;&#x540E;&#x7684;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x5427;&#x3002;&#x56E0;&#x4E3A;&#x73B0;&#x5B9E;&#x7684;&#x76F8;&#x805A;&#x79BB;&#x522B;&#xFF0C;&#x624D;&#x6709;&#x4E86;&#x771F;&#x6B63;&#x7684;&#x73CD;&#x60DC;&#x3002;&#x8FD9;&#x4E2A;&#x5730;&#x65B9;&#x89C1;&#x8BC6;&#x8FC7;&#x592A;&#x591A;&#x7684;&#x4EBA;&#x6765;&#x4EBA;&#x5F80;&#xFF0C;&#x7ECF;&#x5386;&#x592A;&#x591A;&#x4EBA;&#x7684;&#x79BB;&#x5F00;&#x4E4B;&#x540E;&#x662F;&#x4EBA;&#x8D70;&#x8336;&#x51C9;&#xFF0C;&#x6709;&#x4E9B;&#x662F;&#x53EF;&#x60DC;&#xFF0C;&#x6709;&#x4E9B;&#x662F;&#x65E0;&#x5948;&#x3002;&#x5E86;&#x5E78;&#x7684;&#x662F;&#x7EC8;&#x80FD;&#x6709;&#x8DA3;&#x5473;&#x76F8;&#x6295;&#x7684;&#x5C0F;&#x4F19;&#x4F34;&#x613F;&#x610F;&#x73CD;&#x89C6;&#x8FD9;&#x6BB5;&#x4EA4;&#x96C6;&#xFF0C;&#x6210;&#x5C31;&#x4E86;&#x771F;&#x6B63;&#x7684;&#x53CB;&#x8C0A;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x7684;&#x6211;&#x8D8A;&#x6765;&#x8D8A;&#x8BA4;&#x8BC6;&#x5230;&#x4EC0;&#x4E48;&#x624D;&#x662F;&#x5DE5;&#x4F5C;&#x7ED9;&#x6211;&#x5E26;&#x6765;&#x7684;&#x6700;&#x5927;&#x7684;&#x6536;&#x83B7;&#xFF0C;&#x4E0D;&#x662F;&#x8D22;&#x5BCC;&#x3001;&#x4E5F;&#x4E0D;&#x662F;&#x903C;&#x683C;&#xFF0C;&#x800C;&#x662F;&#x4EBA;&#xFF0C;&#x662F;&#x8D70;&#x5230;&#x54EA;&#x91CC;&#x90FD;&#x80FD;&#x7ED3;&#x8BC6;&#x5230;&#x5FD7;&#x6C14;&#x76F8;&#x6295;&#x7684;&#x53CB;&#x4EBA;&#x7684;&#x90A3;&#x79CD;&#x798F;&#x6C14;&#xFF0C;&#x662F;&#x5F7C;&#x6B64;&#x65E5;&#x590D;&#x4E00;&#x65E5;&#x7684;&#x5E76;&#x80A9;&#x6218;&#x6597;&#x4E2D;&#x4EA7;&#x751F;&#x7684;&#x5404;&#x79CD;&#x5FC3;&#x7075;&#x7684;&#x4EA4;&#x5F80;&#x3002;&#x6700;&#x540E;&#x5373;&#x4F7F;&#x8131;&#x8EAB;&#x79BB;&#x5F00;&#xFF0C;&#x4F46;&#x4EBA;&#x4E0E;&#x4EBA;&#x4E4B;&#x95F4;&#x7684;&#x7F81;&#x7ECA;&#x5374;&#x771F;&#x5B9E;&#x5B58;&#x5728;&#xFF0C;&#x5E76;&#x6C38;&#x8FDC;&#x6C89;&#x6DC0;&#x4E86;&#x4E0B;&#x6765;&#x3002;</p>
<p>&#x76F8;&#x8BC6;&#x4E0D;&#x6613;&#xFF0C;&#x53CB;&#x8C0A;&#x4E0D;&#x8001;&#x3002;&#x7279;&#x522B;&#x559C;&#x6B22;&#x59D0;&#x592B;&#x90A3;&#x5F20;&#x6714;&#x56ED;&#x91CC;&#x7684;&#x5408;&#x7167;&#xFF0C;&#x6709;&#x8001;&#x53CB;&#x8BB0;&#x7684;style&#xFF01;&#x5927;&#x5BB6;&#x5206;&#x6563;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x7EBF;&#x4E0A;&#xFF0C;&#x671D;&#x7740;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x5411;&#x884C;&#x8D70;&#xFF0C;&#x4F46;&#x5F7C;&#x6B64;&#x56DE;&#x987E;&#xFF0C;&#x76F8;&#x89C6;&#x4E00;&#x7B11;&#xFF0C;&#x6E29;&#x6696;&#x7EAF;&#x771F;&#x3002;&#x81F4;&#x53CB;&#x8C0A;&#xFF01;</p>
<p><img src="http://7xr6h2.com1.z0.glb.clouddn.com/%E4%B8%8A%E5%A4%A7%E8%8F%8A%E8%8A%B1%E5%B1%95.jpg" alt="2014 &#x4E0A;&#x6D77;&#x5927;&#x5B66; &#x6714;&#x56ED;"></p>

            </div>

            
            <section class="reward">
                <!-- Donate Module -->
<div id="donate_module">
    <style type="text/css">
        .hidden {
            display: none;
        }
        .donate_bar a.btn_donate {
            display: inline-block;
            width: 82px;
            height: 82px;
            background: url("http://img.t.sinajs.cn/t5/style/images/apps_PRF/e_media/btn_reward.gif") no-repeat;
            _background: url("http://img.t.sinajs.cn/t5/style/images/apps_PRF/e_media/btn_reward.gif") no-repeat;

            -webkit-transition: background 0s;
            -moz-transition: background 0s;
            -o-transition: background 0s;
            -ms-transition: background 0s;
            transition: background 0s;
        }
        .donate_bar a.btn_donate:hover {
            background-position: 0 -82px;
        }
        .donate_bar .donate_txt {
            display: block;
            color: #9d9d9d;
            font: 14px/2 "Microsoft Yahei";
        }
        .bold {
            font-weight: bold;
        }

        img.qrcode {
            width: 90%;
            margin-bottom: 10px;
        }
        @media only screen and (min-width: 1025px) {
            img.qrcode {
                width: 40%;
                margin-right: 10px;
            }
        }

    </style>

    <!-- btn_donate & tips -->
    <div id="donate_board" class="donate_bar center">
        <a id="btn_donate" class="btn_donate" target="_self" href="javascript:;" title="Donate 打赏"></a>
        <span class="donate_txt">看完啦? 够意思!  土豪~交个朋友吧...</span>
    </div>
    <!-- /btn_donate & tips -->

    <!-- donate guide -->
    <div id="donate_guide" class="donate_bar center hidden">
        
        <img class="qrcode" src="http://7xr6h2.com1.z0.glb.clouddn.com/alipay.png" title="打赏"/>
        
        <img class="qrcode" src="http://7xr6h2.com1.z0.glb.clouddn.com/wechatMe.png" title="打赏"/>
        
    </div>
    <!-- /donate guide -->

    <!-- donate script -->
    <script type="text/javascript">
        document.getElementById('btn_donate').onclick = function() {
            $('#donate_board').addClass('hidden');
            $('#donate_guide').removeClass('hidden');
        }

        function donate_on_web() {
            $('#donate').submit();
        }
    </script>
    <!-- /donate script -->
</div>
<!-- /Donate Module -->

            </section>
            

            <!-- 阅读量 -->
            <span id="busuanzi_container_page_pv">
            <i class="fa fa-eye"></i>
                文章阅读量 <span id="busuanzi_value_page_pv" style="color:indigo">-link-context"></span>次
            </span>
        </div>
    </div>

</article>

<!-- 分享-->
<script>window._bd_share_config={"common":{"bdSnsKey":{},"bdText":"","bdMini":"1","bdMiniList":false,"bdPic":"","bdStyle":"0","bdSize":"16"},"slide":{"type":"slide","bdImg":"6","bdPos":"right","bdTop":"173.5"}};with(document)0[(getElementsByTagName('head')[0]||body).appendChild(createElement('script')).src='http://bdimg.share.baidu.com/static/api/js/share.js?v=89860593.js?cdnversion='+~(-new Date()/36e5)];</script>




    <section id="comment">
        <div class="card">
            <div class="card-content">
                <!-- Changyan Comment BEGIN -->
                <!--PC和WAP自适应版-->
                <div id="SOHUCS" sid="visit-rokgy-home/"></div>
                <script type="text/javascript">
                    (function(){
                        var appid = 'cysUBoMLM';
                        var conf = 'prod_a50906365a850d1c20808db85906c755';
                        var width = window.innerWidth || document.documentElement.clientWidth;
                        if (width < 960) {
                            window.document.write('<script id="changyan_mobile_js" charset="utf-8" type="text/javascript" ' +
                                    'src="https://changyan.sohu.com/upload/mobile/wap-js/changyan_mobile.js?client_id=' + appid +
                                    '&conf=' + conf + '"><\/script>'); }
                        else { var loadJs=function(d,a){var c=document.getElementsByTagName("head")[0]
                                ||document.head||document.documentElement;var b=document.createElement("script");
                            b.setAttribute("type","text/javascript");b.setAttribute("charset","UTF-8");
                            b.setAttribute("src",d);
                            if(typeof a==="function"){if(window.attachEvent){b.onreadystatechange=
                                    function(){var e=b.readyState;if(e==="loaded"||e==="complete"){b.onreadystatechange=null;a()}}}
                            else{b.onload=a}}c.appendChild(b)};loadJs("https://changyan.sohu.com/upload/changyan.js",
                                function(){window.changyan.api.config({appid:appid,conf:conf})});
                        } })();
                </script>
                <!-- Changyan Comment END -->
            </div>
        </div>
    </section>


<!--友言-->
<!--&lt;!&ndash; UY BEGIN &ndash;&gt;-->
<!--<div id="uyan_frame"></div>-->
<!--<script type="text/javascript" src="http://v2.uyan.cc/code/uyan.js?uid=2094227"></script>-->
<!--&lt;!&ndash; UY END &ndash;&gt;-->
</div>

        <div class="fixed-action-btn float-sitemap">
    <a class="btn-floating btn-large green">
      <i class="fa fa-caret-square-o-up"></i>
    </a>
    <ul>
      <li><a class="btn-return-top btn-floating waves-effect blue" title="回到顶部"><i class="fa fa-arrow-circle-o-up"></i></a></li>
      <li><a class="btn-floating waves-effect button-collapse orange"  data-activates="main-menu" title="菜单"><i class="fa fa-navicon"></i></a></li>
    </ul>
  </div>

    </main>
    <footer class="page-footer indigo darken-1">
    
    <div class="container">
        <div class="row">
            
            <div class="social-group col m4 s12">
                <h5 class="white-text">社交</h5>
                
                    <a class="social-link" href="http://weibo.com/hydra7249" target="_blank">
                        <i class="fa fa-2x fa-weibo"></i>
                    </a>
                
                    <a class="social-link" href="http://www.douban.com/people/36529994/" target="_blank">
                        <i class="fa fa-2x fa-star-half-o"></i>
                    </a>
                
                    <a class="social-link" href="https://twitter.com/hydra7249" target="_blank">
                        <i class="fa fa-2x fa-twitter"></i>
                    </a>
                
                    <a class="social-link" href="https://www.pinterest.com/snowvivi/" target="_blank">
                        <i class="fa fa-2x fa-pinterest"></i>
                    </a>
                
                    <a class="social-link" href="https://github.com/olddoggie" target="_blank">
                        <i class="fa fa-2x fa-github"></i>
                    </a>
                
                    <a class="social-link" href="/atom.xml" target="_blank">
                        <i class="fa fa-2x fa-rss"></i>
                    </a>
                
            </div>
            

            
            <div class="col m8 s12">
                <h5 class="white-text">友情链接</h5>
                
                    <a class="social-link" href="http://foredoomed.org/" target="_blank">Zhixingheyi</a>
                
                    <a class="social-link" href="http://blog.sina.com.cn/rokgy" target="_blank">rokgy的博客</a>
                
                    <a class="social-link" href="http://www.dandyweng.com/" target="_blank">dandyweng的博客</a>
                
                    <a class="social-link" href="https://xiaolife.com/" target="_blank">Life Journal</a>
                
                    <a class="social-link" href="http://www.netcan666.com/" target="_blank">Netcan</a>
                
            </div>
            
        </div>
    </div>
    


    <div class="footer-copyright indigo-link-context">
        <div class="container">
            <div class="row">
                <div class="col m4 s12">
                    © 2017 jkup2.us, All rights reserved.
                </div>
                <div class="col m8 s12">
                    <i class="fa fa-rocket"></i> Hexo | 主题 raytaylorism
                    | 总字数 <span>74.7k</span>
                    | 总访问量 <span id="busuanzi_value_site_pv"></span> |
                    访客人次 <span id="busuanzi_value_site_uv"></span> |
                    页点击量 <span id="busuanzi_value_page_pv"></span>
                </div>
            </div>
        </div>
    </div>

    <script async src="https://dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js">
    </script>
</footer>


    <noscript>
    <div class="noscript">
        <p class="center-align">当前浏览器不支持博客完整功能。如果要获得最佳体验，请点击右上角···，复制链接，并在其它浏览器打开</p>
    </div>
</noscript>
<div class="noscript">
    <p class="center-align">当前浏览器不支持博客完整功能。如果要获得最佳体验，请点击右上角···，复制链接，并在其它浏览器打开</p>
</div>

<link rel="stylesheet" type="text/css" href="/css/xcConfirm.css"/>

<script src="/js/jquery-2.1.1.min.js"></script>
<script src="/js/materialize.min.js"></script>
<script src="/js/search.js"></script>
<script src="/js/base64.js"></script>
<script src="/js/xcConfirm.js"></script>


<script>
(function($) {
    $(document).ready(function() {
        // 隐藏禁用javascript（针对微信内置浏览器）的提示
        $('.noscript').hide();

        // 图片缩放效果
        var $imgs = $('img').not('.slider-image').not('.avatar-image').not('.carousel-image').not('.card-cover-image').not('.qrcode');

        // 给图片加上点击放大效果（materialbox插件）
        $imgs.addClass('materialboxed')
            .each(function(i, el) {
                $(this).attr('data-caption', $(this).attr('alt') || ' ');
            }).materialbox();

        // 首页幻灯片
        $('.slider').slider({
            indicators: true,
            full_width: true,
            interval: 8000
        });

        $(".button-collapse").sideNav();
        $(".category-menu").sideNav();

        // 针对gallery post
        $('.carousel').carousel({
            full_width: true
        });
        $('.carousel-control.prev').click(function() {
            $('.carousel').carousel('prev');
        });
        $('.carousel-control.next').click(function() {
            $('.carousel').carousel('next');
        });

        // 文章目录
        $('article').not('.simple-article').find('h1').add('h2').add('h3').add('h4').add('h5').add('h6').scrollSpy();
        // 修正文章目录的left-border颜色
        var color = $('.table-of-contents-text').css('color');
        $('.table-of-contents-link').css('border-left-color', color);

        // 针对移动端做的优化：FAB按钮点击一下收回
        if (/Android|webOS|iPhone|iPad|iPod|BlackBerry|IEMobile|Opera Mini/i.test(navigator.userAgent)) {
            $('.fixed-action-btn').addClass('click-to-toggle');
        }
        // 回到顶部
        $('.btn-return-top').click(function() {
            $('body, html').animate({
                scrollTop: 0
            }, 500);
        });

        // 重置读书页面的Tab标签页的颜色
        $('li.tab a').hover(function() {
            $(this).toggleClass('text-lighten-4');
        });
        $('.indicator').addClass('green lighten-2');

        
        // 添加new标签
        $('.menu-reading').append('<span class="new badge pink"></span>');
        
    });
})(jQuery);
</script>


<script src="/js/prettify.js"></script>
<script type="text/javascript">
    $(document).ready(function() {
        $("pre").addClass("prettyprint");
        prettyPrint();
    });
</script>






<script type="text/x-mathjax-config">
MathJax.Hub.Config({
  tex2jax: {inlineMath: [['$','$'], ['\\(','\\)']]}
});
</script>
<script type="text/javascript"
    src="http://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML">
</script>



<script type="text/javascript">
    var search_path = "search.xml";
    if (search_path.length == 0) {
        search_path = "search.xml";
    }
    var path = "/" + search_path;
    searchFunc(path, 'local-search-input', 'local-search-result');
</script>

<!--1. category或tag页面是private/PRIVATE的需要密码-->
<!--2. 文章tag当中有private/PRIVATE的需要密码-->
<!--3. 理论上文章列表页面上tag当中有private/PRIVATE的文章已经被过滤,但如果存在,不影响页面展示,当点击文章链接后需要密码-->
<script type="text/javascript">
    var b = new Base64();
    var passwd = b.decode("c3c=")
    var url = window.location.toString().split("/");
    var urlLen = url.length;
    // <http_host>/categories/生活/private/ : 截取urlCat=categories; urlNm=private
    var urlCat = url[urlLen-4].trim();
    var urlNm = url[urlLen-2].trim();
    (function(){
        if( (urlCat == "categories" || urlCat == "tags") && (urlNm=="private" || urlNm == "PRIVATE")){
//          不能使用较为方便的prompt方法,因为这样无法控制js的渲染顺序,有可能出现页面已经加载出内容,同时弹出密码框,这样起不到加密作用
//            if(prompt('请输入文章密码') !== passwd){
//                alert('密码错误！');
//                history.back();
//            }
            // 解决方法是自己写popUp弹出框,并通过页面图层覆盖来达到防偷窥效果:
            // 1. 先把页面至于全白
            $('#loadingDiv').css('display','block');
            // 2. 调用自定义的pop box ; 3. 回调函数中指定密码比较逻辑,比较成功后将全白图层隐藏
            window.wxc.xcConfirm("请输入文章密码", window.wxc.xcConfirm.typeEnum.input,
                    {onOk:function(v){
                        if(v!=passwd) {
                            alert('密码错误！');
                            history.back();
                        } else {
                            $('#loadingDiv').css('display','none');
                        }
                    }} );
        }
    })();
    var nonSecret= true;
    var tags = document.getElementsByClassName("tags-row");
    (function(){
        for (var i = 0; i < tags.length; i++) {
            var tagName = tags[i].innerHTML.replace(/<[^>]+>/g,"").trim();
            if(urlCat!="page" && urlCat!="categories" && urlCat!="tags" &&(tagName.indexOf("private")>=0 || tagName.indexOf("PRIVATE")>=0)){
                nonSecret=false
            }
        }
        if (!nonSecret) {
            // 1. 先把页面至于全白
            $('#loadingDiv').css('display','block');
            // 2. 调用自定义的pop box ; 3. 回调函数中指定密码比较逻辑,比较成功后将全白图层隐藏
            window.wxc.xcConfirm("请输入文章密码", window.wxc.xcConfirm.typeEnum.input,
                    {onOk:function(v){
                        if(v!=passwd) {
                            alert('密码错误！');
                            history.back();
                        } else {
                            $('#loadingDiv').css('display','none');
                        }
                    }} );
        }
    })();
    // 收藏页面的 TO DO 部分暂时没有必要加密,只是一些在读的书和博客方面的想法
//    (function(){
//        if(urlNm == "reading"){
//            // 点击按钮后触发加密事件
//            var readingType = document.getElementsByClassName('green-text');
//            readingType[2].onclick = function() {
//                // 1. 先把页面至于全白
//                $('#loadingDiv').css('display','block');
//                // 2. 调用自定义的pop box ; 3. 回调函数中指定密码比较逻辑,比较成功后将全白图层隐藏
//                window.wxc.xcConfirm("请输入文章密码", window.wxc.xcConfirm.typeEnum.input,
//                        {onOk:function(v){
//                            if(v!=passwd) {
//                                alert('密码错误！');
//                                history.back();
//                            } else {
//                                $('#loadingDiv').css('display','none');
//                            }
//                        }} );
//            }
//        }
//    })();
</script>

</body>
</html>
